{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, science, university, events, olympiad, high, state, teams. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Science Olympiad - Wikipedia (en.wikipedia.org). Evidence: American school science competition; This article is about competition for schools in the United States. For the international competitions, see; International Science Olympiad; . For the Indian competition, see", "reference_sheet": "TOPIC MAP: school | science | university | events | olympiad | high | state | teams\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia American school science competition This article is about competition for schools in the United States.\n- For the international competitions, see International Science Olympiad .\n- For the Indian competition, see National Science Olympiad .\n- Please improve it by verifying the claims made and adding inline citations .\n- Statements consisting only of original research should be removed.\n- ( March 2023 ) ( Learn how and when to remove this message ) Science Olympiad logo Science Olympiad , sometimes abbreviated as SciOly or SO , is an American team competition in whi\n- The subjects include earth science , biology , chemistry , physics , and engineering .\n- Over 7,800 middle school and high school teams from 50 U.S.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: However, several international teams do compete in Science Olympiad tournaments in the U.S.\n- Example seed: [ 4 ] There are multiple levels of the competition: invitational, regional, state, and national.\n- Example seed: Invitational tournaments, usually run by high schools and universities, are unofficial tournaments and serve as practice for regional and state competitions.\n- Example seed: [ 5 ] Teams that excel at regional competitions advance to the state level; the top one or two teams from each state (depending on the state) then advance the n\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Science Olympiad - Wikipedia", "url": "https://en.wikipedia.org/wiki/Science_Olympiad", "title": "Science Olympiad - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, science, retrieved, crime, analysis, evidence, archived, original. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Forensic science - Wikipedia (en.wikipedia.org). Evidence: Application of science to criminal and civil laws; Several terms redirect here. For other uses, see; Crime scene investigation (disambiguation); This article has multiple issues.", "reference_sheet": "TOPIC MAP: forensic | science | retrieved | crime | analysis | evidence | archived | original\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia (Redirected from Forensics ) Application of science to criminal and civil laws Several terms redirect here.\n- For other uses, see Forensic (disambiguation) , Forensics (disambiguation) , and Crime scene investigation (disambiguation) .\n- Please help improve it or discuss these issues on the talk page .\n- ( Learn how and when to remove these messages ) The neutrality of this article is disputed .\n- Relevant discussion may be found on the talk page .\n- Please do not remove this message until conditions to do so are met .\n- ( March 2022 ) ( Learn how and when to remove this message ) This article is written like a personal reflection, personal essay, or argumentative essay that states a Wikipedia edit\n- Please help improve it by rewriting it in an encyclopedic style .\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: ( May 2022 ) ( Learn how and when to remove this message ) ( Learn how and when to remove this message ) Part of a series on Forensic science Physiological Anth\n- Example seed: During criminal investigation in particular, it is governed by the legal standards of admissible evidence and criminal procedure .\n- Example seed: It is a broad field utilizing numerous practices such as the analysis of DNA , fingerprints , bloodstain patterns , firearms , ballistics , toxicology , microsc\n- Example seed: Modern forensic analysis is also conducted on cybersecurity related incidents where major breach has occurred leading to substantial financial loss.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Forensic science - Wikipedia", "url": "https://en.wikipedia.org/wiki/Forensics", "title": "Forensic science - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: astronomy, science, astronomical, astrophysics, astronomers, physical. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Astronomy - Wikipedia (en.wikipedia.org). Evidence: Scientific study of celestial objects; This article is about the scientific study of celestial objects; it is not to be confused with; in the atmosphere to observe the; to explain their origin and their overall", "reference_sheet": "TOPIC MAP: astronomy | science | astronomical | astrophysics | astronomers | physical\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Scientific study of celestial objects This article is about the scientific study of celestial objects; it is not to be confused with Astrology\n- For other uses, see Astronomy (disambiguation) .\n- The Paranal Observatory of European Southern Observatory creating a laser guide star in the atmosphere to observe the Galactic Center Astronomy is a natural science that studies ce\n- It uses mathematics , physics , and chemistry to explain their origin and their overall evolution .\n- Objects of interest include planets , moons , stars , nebulae , galaxies , meteoroids , asteroids , and comets .\n- Relevant phenomena include supernova explosions, gamma ray bursts , quasars , blazars , pulsars , and cosmic microwave background radiation .\n- More generally, astronomy studies everything that originates beyond Earth's atmosphere .\n- Cosmology is the branch of astronomy that studies the universe as a whole.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Astronomy is one of the oldest natural sciences.\n- Example seed: The early civilizations in recorded history made methodical observations of the night sky .\n- Example seed: These include the Egyptians , Babylonians , Greeks , Indians , Chinese , Maya , and many ancient indigenous peoples of the Americas .\n- Example seed: In the past, astronomy included disciplines as diverse as astrometry , celestial navigation , observational astronomy , and the making of calendars .\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Astronomy - Wikipedia", "url": "https://en.wikipedia.org/wiki/Astronomy", "title": "Astronomy - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: anatomy, biology, anatomical, physiology. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Anatomy - Wikipedia (en.wikipedia.org). Evidence: Study of the structure of organisms; \"Anatomic\" redirects here. For the Afro Celt Sound System album, see; For the anatomy of plants, see; One of the large, detailed illustrations in", "reference_sheet": "TOPIC MAP: anatomy | biology | anatomical | physiology\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Study of the structure of organisms \"Anatomic\" redirects here.\n- For the Afro Celt Sound System album, see Volume 5: Anatomic .\n- For the anatomy of plants, see Plant anatomy .\n- For other uses, see Anatomy (disambiguation) .\n- One of the large, detailed illustrations in Andreas Vesalius 's De humani corporis fabrica 16th century, marking the rebirth of anatomy [ 1 ] Part of a series on Biology Index Outl\n- [ 2 ] Anatomy is a branch of natural science that deals with the structural organization of living things.\n- It is an old science, having its beginnings in prehistoric times.\n- [ 3 ] Anatomy is inherently tied to developmental biology , embryology , comparative anatomy , evolutionary biology , and phylogeny , [ 4 ] as these are the processes by which anat\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Anatomy and physiology , which study the structure and function of organisms and their parts respectively, make a natural pair of related disciplines, and are o\n- Example seed: Human anatomy is one of the essential basic sciences that are applied in medicine, and is often studied alongside physiology .\n- Example seed: [ 5 ] Anatomy is a complex and dynamic field that is constantly evolving as discoveries are made.\n- Example seed: In recent years, there has been a significant increase in the use of advanced imaging techniques, such as MRI and CT scans , which allow for more detailed and a\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Anatomy - Wikipedia", "url": "https://en.wikipedia.org/wiki/Anatomy", "title": "Anatomy - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: olympiad, science, astronomy, physics, chemistry, biology. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: International Science Olympiad - Wikipedia (en.wikipedia.org). Evidence: International Olympic Committee; Set of global competitions for the sciences; needs additional citations for; adding citations to reliable sources", "reference_sheet": "TOPIC MAP: olympiad | science | astronomy | physics | chemistry | biology\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Not to be confused with Science Olympiad or International Olympic Committee .\n- Set of global competitions for the sciences This article needs additional citations for verification .\n- Please help improve this article by adding citations to reliable sources .\n- Unsourced material may be challenged and removed.\n- Find sources: \"International Science Olympiad\" – news · newspapers · books · scholar · JSTOR ( March 2018 ) ( Learn how and when to remove this message ) The International Science \n- The competitions are designed for the 4-6 best high school students from each participating country selected through internal National Science Olympiads, with the exception of the \n- Early editions of the first Olympiads were limited to the Eastern Bloc , but later they gradually spread to other countries.\n- [ 1 ] Overview The Olympiads themselves are separate competitions each with its own organizing body, even though they are loosely grouped together as \"ISOs\".\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: The aims of each ISO are to promote a career in science; to challenge the brightest students from around the world; and to compare the various teaching systems \n- Example seed: Although the competitions are aimed for secondary school pupils, the standards of the exams are extremely high.\n- Example seed: [ citation needed ] International Science Olympiads Science Olympiads are international student competitions.\n- Example seed: There are 12 commonly recognized International Science Olympiads: # Science Olympiad Abbreviation Years 2025 host country 2026 host country 1 International Math\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: International Science Olympiad - Wikipedia", "url": "https://en.wikipedia.org/wiki/International_Science_Olympiad", "title": "International Science Olympiad - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: olympiad, students, science, international, foundation, level, exam, india. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Science Olympiad Foundation - Wikipedia (en.wikipedia.org). Evidence: Educational foundation in India; For the primary/secondary school competition in the United States, see; needs additional citations for; adding citations to reliable sources", "reference_sheet": "TOPIC MAP: olympiad | students | science | international | foundation | level | exam | india\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia (Redirected from National Science Olympiad ) Educational foundation in India For the primary/secondary school competition in the United States\n- This article needs additional citations for verification .\n- Please help improve this article by adding citations to reliable sources .\n- Unsourced material may be challenged and removed.\n- Find sources: \"Science Olympiad Foundation\" – news · newspapers · books · scholar · JSTOR ( January 2016 ) ( Learn how and when to remove this message ) Science Olympiad Foundation\n- Mahabir Singh Type Non-profit Legal status Foundation Purpose Education Headquarters Gurugram, Haryana , India Region North India Services Education Official language English Secre\n- However, they are not the official organizer of Olympiads in India.\n- [ 1 ] Olympiads [ edit ] Every year over 91000+ schools from 70+ countries register for the 8 Olympiad exams and millions of students appear in them.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Current [ edit ] Annually, about 5 million students take part in each of the following Olympiad exams: International Computer Science Olympiad (ICSO) is a singl\n- Example seed: Students from class I-X may participate in the examination.\n- Example seed: National Science Olympiad (NSO) is conducted at two levels each year.\n- Example seed: Students from class I-XII may participate in the examination.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Science Olympiad Foundation - Wikipedia", "url": "https://en.wikipedia.org/wiki/National_Science_Olympiad", "title": "Science Olympiad Foundation - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: file, logo, wikipedia, non-free, science, olympiad, image, pixels. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: File:Science Olympiad Logo.svg - Wikipedia (en.wikipedia.org). Evidence: Size of this PNG preview of this SVG file:; (SVG file, nominally 289 × 148 pixels, file size: 39 KB); This is the logo for Science Olympiad.; The logo is from the following website:", "reference_sheet": "TOPIC MAP: file | logo | wikipedia | non-free | science | olympiad | image | pixels\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia File File history File usage Metadata Size of this PNG preview of this SVG file: 289 × 148 pixels .\n- Other resolutions: 320 × 164 pixels | 640 × 328 pixels | 1,024 × 524 pixels | 1,280 × 656 pixels | 2,560 × 1,311 pixels .\n- Original file (SVG file, nominally 289 × 148 pixels, file size: 39 KB) ✓ The source code of this SVG is valid .\n- Summary [ edit ] Non-free media information and use rationale – non-free logo true for Science Olympiad Description This is the logo for Science Olympiad.\n- Source The logo is from the following website: http://www.soinc.org/download/logos/index.htm Article Science Olympiad Portion used The entire logo is used to convey the meaning int\n- This is an SVG vector image of a registered trademark or a copyright-protected logo , seal or computer icon .\n- This image should not be rendered any larger than is required for the purposes of identification and/or critical commentary.\n- The default rendering of this image is of a size and resolution sufficient to maintain the quality intended by the company or organization, without being unnecessarily high resolut\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Purpose of use The image is used to identify the organization Science Olympiad, a subject of public interest.\n- Example seed: The significance of the logo is to help the reader identify the organization, assure the readers that they have reached the right article containing critical co\n- Example seed: Because it is a non-free logo, there is almost certainly no free representation.\n- Example seed: Any substitute that is not a derivative work would fail to convey the meaning intended, would tarnish or misrepresent its image, or would fail its purpose of id\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: File:Science Olympiad Logo.svg - Wikipedia", "url": "https://en.wikipedia.org/wiki/File:Science_Olympiad_Logo.svg", "title": "File:Science Olympiad Logo.svg - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: science, physical, ecology, geophysics. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Earth science - Wikipedia (en.wikipedia.org). Evidence: Fields of natural science related to Earth; needs additional citations for; adding citations to reliable sources; . Unsourced material may be challenged and removed.", "reference_sheet": "TOPIC MAP: science | physical | ecology | geophysics\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Fields of natural science related to Earth This article needs additional citations for verification .\n- Please help improve this article by adding citations to reliable sources .\n- Unsourced material may be challenged and removed.\n- Find sources: \"Earth science\" – news · newspapers · books · scholar · JSTOR ( August 2025 ) ( Learn how and when to remove this message ) The rocky side of a mountain creek in Cost\n- [ 1 ] This is a branch of science dealing with the physical, chemical, and biological complex constitutions and synergistic linkages of Earth's four spheres: the biosphere , hydros\n- Earth science can be considered to be a branch of planetary science but with a much older history.\n- Geology [ edit ] Layers of sedimentary rock in Makhtesh Ramon Geology is broadly the study of Earth's structure, substance, and processes.\n- Geology is largely the study of the lithosphere , or Earth's surface, including the crust and rocks .\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: It includes the physical characteristics and processes that occur in the lithosphere as well as how they are affected by geothermal energy .\n- Example seed: It incorporates aspects of chemistry, physics, and biology as elements of geology interact.\n- Example seed: Historical geology is the application of geology to interpret Earth history and how it has changed over time.\n- Example seed: Geochemistry studies the chemical components and processes of the Earth.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Earth science - Wikipedia", "url": "https://en.wikipedia.org/wiki/Earth_science", "title": "Earth science - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: biology, science, biological, chemical, ecology. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Biology - Wikipedia (en.wikipedia.org). Evidence: \"Biological\" redirects here. For other uses, see; that encompasses a wide range of fields and unifying principles that explain the structure, function, growth,; , and distribution of life. Central to biology are five fundamental themes: the; as the basis of inheritance, evolution as the driver of", "reference_sheet": "TOPIC MAP: biology | science | biological | chemical | ecology\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Scientific study of life \"Biological\" redirects here.\n- For other uses, see Biological (disambiguation) and Biology (disambiguation) .\n- Clockwise from upper left: A Nile crocodile , the common sunflower , Amoeba proteus , Sarcoscypha coccinea , the fruit fly , and Escherichia coli .\n- Part of a series on Biology Index Outline Glossary History ( timeline ) Key components Cell theory Ecosystem Evolution Phylogeny Properties of life Adaptation Energy processing Gro\n- It is a broad natural science that encompasses a wide range of fields and unifying principles that explain the structure, function, growth, origin , evolution , and distribution of\n- Central to biology are five fundamental themes: the cell as the basic unit of life, genes and heredity as the basis of inheritance, evolution as the driver of biological diversity \n- [ 1 ] [ 2 ] Biology examines life across multiple levels of organization , from molecules and cells to organisms, populations , and ecosystems .\n- Subdisciplines include molecular biology , physiology , ecology , evolutionary biology , developmental biology , and systematics , among others.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Each of these fields applies a range of methods to investigate biological phenomena, including observation, experimentation , and mathematical modeling .\n- Example seed: Modern biology is grounded in the theory of evolution by natural selection , first articulated by Charles Darwin , and in the molecular understanding of genes e\n- Example seed: The discovery of the structure of DNA and advances in molecular genetics have transformed many areas of biology, leading to applications in medicine , agricultu\n- Example seed: Life on Earth is believed to have originated over 3.7 billion years ago.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Biology - Wikipedia", "url": "https://en.wikipedia.org/wiki/Biology", "title": "Biology - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: chemistry, chemical, science, physical, alchemy. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Chemistry - Wikipedia (en.wikipedia.org). Evidence: Scientific study of matter's behavior and properties; \"Chemical science\" redirects here. For the journal, see; is the scientific study of the properties and behavior of; : their composition, structure, properties, behavior and the changes they undergo during", "reference_sheet": "TOPIC MAP: chemistry | chemical | science | physical | alchemy\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Scientific study of matter's behavior and properties For other uses, see Chemistry (disambiguation) .\n- For the journal, see Chemical Science (journal) .\n- Part of a series on Chemistry Index Outline Glossary History ( timeline ) Key components Matter Phase Bond Chemical reaction Ion Acid–base reaction Redox Chemical equilibrium Chemi\n- [ 1 ] [ 2 ] It is a physical science within the natural sciences that studies the chemical elements that make up matter and compounds made of atoms , molecules and ions : their com\n- [ 3 ] [ 4 ] [ 5 ] [ 6 ] Chemistry also addresses the nature of chemical bonds in chemical compounds .\n- In the scope of its subject, chemistry occupies an intermediate position between physics and biology .\n- [ 7 ] It is sometimes called the central science because it provides a foundation for understanding both basic and applied scientific disciplines at a fundamental level.\n- [ 8 ] For example, chemistry explains aspects of plant growth ( botany ), the formation of igneous rocks ( geology ), how atmospheric ozone is formed and how environmental pollutan\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 9 ] Chemistry has existed under various names since ancient times.\n- Example seed: [ 10 ] It has evolved, and now chemistry encompasses various areas of specialisation, or subdisciplines, that continue to increase in number and interrelate to \n- Example seed: The applications of various fields of chemistry are used frequently for economic purposes in the chemical industry .\n- Example seed: [ 11 ] Etymology Main article: Etymology of chemistry The word chemistry comes from a modification during the Renaissance of the word alchemy , which referred t\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Chemistry - Wikipedia", "url": "https://en.wikipedia.org/wiki/Chemistry", "title": "Chemistry - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: physics, science, physical, physicists. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Physics - Wikipedia (en.wikipedia.org). Evidence: , clockwise from the upper left; ), an insect floating across a pond (; It is one of the most fundamental scientific disciplines.; A scientist who specializes in the field of physics is called a", "reference_sheet": "TOPIC MAP: physics | science | physical | physicists\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Scientific field of study For other uses, see Physics (disambiguation) .\n- Phenomena and processes of physics' various domains , clockwise from the upper left [ a ] : a Newton's cradle ( classical mechanics ), entropic changes in a snowflake ( thermodynam\n- Part of a series on Physics Index Outline Glossary History ( timeline ) Branches Acoustics Astrophysics Atomic physics Biophysics Classical physics Electromagnetism Geophysics Mech\n- [ 1 ] It is one of the most fundamental scientific disciplines.\n- [ 2 ] [ 3 ] [ 4 ] A scientist who specializes in the field of physics is called a physicist .\n- Physics is one of the oldest academic disciplines .\n- [ 5 ] Over much of the past two millennia, physics, chemistry , biology , and certain branches of mathematics were a part of natural philosophy , but during the Scientific Revoluti\n- Physics intersects with many interdisciplinary areas of research, such as biophysics and quantum chemistry , and the boundaries of physics are not rigidly defined.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: New ideas in physics often explain the fundamental mechanisms studied by other sciences [ 2 ] and suggest new avenues of research in these and other academic di\n- Example seed: Advances in physics often enable new technologies .\n- Example seed: For example, advances in the understanding of electromagnetism , solid-state physics , and nuclear physics led directly to the development of technologies that \n- Example seed: History Main article: History of physics The word physics comes from the Latin physica ('study of nature'), which itself is a borrowing of the Greek φυσική ( ph\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Physics - Wikipedia", "url": "https://en.wikipedia.org/wiki/Physics", "title": "Physics - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: engineering, science, engineers, isbn, retrieved, archived, design, original. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Engineering - Wikipedia (en.wikipedia.org). Evidence: Hardware description language simulators; List of engineering journals and magazines; Engineering books on Wikibooks; , underscores the importance of engineering in modern history. This", "reference_sheet": "TOPIC MAP: engineering | science | engineers | isbn | retrieved | archived | design | original\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Applied science and research For other uses, see Engineering (disambiguation) .\n- This article is part of a series on Engineering Engineering branches Aerospace Agricultural Architectural Biomedical Chemical Civil Computer Data Design Electrical Electronics Ener\n- This beam engine is on display in the Technical University of Madrid .\n- Engineering is the practice of using natural science , mathematics , and the engineering design process [ 1 ] to solve problems within technology , increase efficiency and producti\n- The traditional disciplines of engineering are civil , mechanical , electrical , and chemical .\n- The academic discipline of engineering encompasses a broad range of more specialized subfields, and each can have a more specific emphasis for applications of mathematics and scien\n- In turn, modern engineering practice spans multiple fields of engineering , which include designing and improving infrastructure , machinery , vehicles , electronics , materials , \n- [ 2 ] For related terms, see glossary of engineering .\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: As a human endeavor, engineering has existed since ancient times, starting with the six classic simple machines .\n- Example seed: Examples of large-scale engineering projects from antiquity include impressive structures like the pyramids , elegant temples such as the Parthenon , and water \n- Example seed: Early machines were powered by humans and animals, then later by wind.\n- Example seed: Machines of war were invented for siegecraft .\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Engineering - Wikipedia", "url": "https://en.wikipedia.org/wiki/Engineering", "title": "Engineering - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: enloe, ncssm, piedmont, charter, academy, north, robinson, science. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: North Carolina Science Olympiad - Wikipedia (en.wikipedia.org). Evidence: North Carolina Science Olympiad; with the mission to attract and retain the pool of K–12 students entering science, technology, engineering, and mathematics (; Every year NCSO hosts tournaments on university, community college, and public school campuses across the state. These tournaments are rigorous academic interscholastic competitions that consist of a series of different hands-on, interactive, challenging and inquiry-based events that are well balanced between the various disciplines of; , engineering and technology. NCSO is housed at The Science House", "reference_sheet": "TOPIC MAP: enloe | ncssm | piedmont | charter | academy | north | robinson | science\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia North Carolina Science Olympiad ( NCSO ) is a nonprofit organization [ 1 ] with the mission to attract and retain the pool of K–12 students en\n- [ 2 ] [ 3 ] Every year NCSO hosts tournaments on university, community college, and public school campuses across the state.\n- These tournaments are rigorous academic interscholastic competitions that consist of a series of different hands-on, interactive, challenging and inquiry-based events that are well\n- NCSO is housed at The Science House [ 4 ] at NC State University .\n- History [ edit ] The first recorded Science Olympiad was held on Saturday, November 23, 1974, at St.\n- Andrews Presbyterian College in Laurinburg , North Carolina.\n- David Wetmore were the originators of this event.\n- Fifteen schools from North and South Carolina participated in this event.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: This Olympiad was a day-long affair, with competitions and demonstrations for high school students in the areas of biology, chemistry, and physics.\n- Example seed: There were four event periods during this day, and each event period had one fun event (like beaker race or paper airplane), one demonstration (like glassblowin\n- Example seed: An article was published in the Journal of Chemical Education in January 1978 documenting the success of recruiting students through Science Olympiad.\n- Example seed: Andrews continues to host a Science Olympiad tournament to this day.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: North Carolina Science Olympiad - Wikipedia", "url": "https://en.wikipedia.org/wiki/North_Carolina_Science_Olympiad", "title": "North Carolina Science Olympiad - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: university, michigan, state, retrieved, archived, college, original, wayback. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Michigan State University - Wikipedia (en.wikipedia.org). Evidence: Public university in East Lansing, Michigan, US; \"Michigan State\" redirects here. For the U.S. state, see; Agricultural College of the State of Michigan (1855–1861); State Agricultural College (1861–1909)", "reference_sheet": "TOPIC MAP: university | michigan | state | retrieved | archived | college | original | wayback\nCORE FACTS/RULES:\n- Coordinates : 42°43′30″N 84°28′48″W ﻿ / ﻿ 42.72500°N 84.48000°W ﻿ / 42.72500; -84.48000 From Wikipedia, the free encyclopedia Public university in East Lansing, Michigan, US \"Michi\n- Michigan State University Former names List Agricultural College of the State of Michigan (1855–1861) State Agricultural College (1861–1909) Michigan Agricultural College (1909–192\n- Transforming Lives.\" [ 3 ] Type Public land-grant research university Established February 12, 1855 ; 171 years ago ( 1855-02-12 ) Accreditation HLC Academic affiliations AAU ORAU \n- It was founded in 1855 as the Agricultural College of the State of Michigan , the first of its kind in the country.\n- [ 8 ] [ 9 ] [ 10 ] After the introduction of the Morrill Act in 1862, the state designated the college a land-grant institution in 1863, making it the first of the land-grant colle\n- Michigan State has facilities across the state, and over 634,000 alumni.\n- The university's six professional schools include the College of Law (founded in Detroit , in 1891, as the Detroit College of Law and moved to East Lansing in 1995), Eli Broad Coll\n- The university pioneered the studies of music therapy , [ 12 ] packaging , hospitality business , supply chain management , and communication sciences .\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Michigan State is a member of the Association of American Universities , [ 13 ] classified among \"R1: Doctoral Universities – Very high research activity\", [ 14\n- Example seed: [ 15 ] The university's campus houses the Facility for Rare Isotope Beams , the W.\n- Example seed: Beal Botanical Garden , the Abrams Planetarium , the Wharton Center for Performing Arts , the Eli and Edythe Broad Art Museum , and the country's largest reside\n- Example seed: [ 16 ] University faculty, alumni, and affiliates include 1 Nobel laureate, [ 17 ] 20 Rhodes Scholars , 20 Marshall Scholars , and 8 Pulitzer Prize winners.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Michigan State University - Wikipedia", "url": "https://en.wikipedia.org/wiki/Michigan_State_University", "title": "Michigan State University - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: stem, education, science, retrieved, archived, original, engineering, technology. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Science, technology, engineering, and mathematics - Wikipedia (en.wikipedia.org). Evidence: Umbrella term for technical disciplines; \"STEM\" redirects here. For other uses, see; , Princeton, New Jersey, United States (1952); Science, technology, engineering, and mathematics", "reference_sheet": "TOPIC MAP: stem | education | science | retrieved | archived | original | engineering | technology\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Umbrella term for technical disciplines \"STEM\" redirects here.\n- Robert Oppenheimer (left) and mathematician John von Neumann in front of an early electronic computer built at the Institute for Advanced Study , Princeton, New Jersey, United Stat\n- It represents a broad and interconnected set of fields that are crucial for innovation and technological advancement.\n- These disciplines are often grouped together because they share a common emphasis on critical thinking , problem-solving , and analytical skills .\n- [ 1 ] The term is typically used in the context of education policy or curriculum choices in schools.\n- It has implications for workforce development, national security concerns (as a shortage of STEM-educated citizens can reduce effectiveness in this area), and immigration policy, w\n- [ 2 ] There is no universal agreement on which disciplines are included in STEM; in particular, whether or not the science in STEM includes social sciences , such as psychology , s\n- In the United States, these are typically included by the National Science Foundation (NSF), [ 2 ] the Department of Labor 's O*Net online database for job seekers, [ 3 ] and the D\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 4 ] In the United Kingdom, the social sciences are categorized separately and are instead grouped with humanities and arts to form another counterpart acronym\n- Example seed: [ 5 ] [ 6 ] Some sources also use HEAL (health, education, administration, and literacy) as the counterpart of STEM.\n- Example seed: [ citation needed ] Terminology [ edit ] History [ edit ] In the early 1990s the acronym STEM was used by a variety of educators.\n- Example seed: Schwartz developed a STEM mentoring program in the Capital District of New York State, and was using the acronym as early as November, 1991.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Science, technology, engineering, and mathematics - Wikipedia", "url": "https://en.wikipedia.org/wiki/Science,_technology,_engineering,_and_mathematics", "title": "Science, technology, engineering, and mathematics - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: carolina, north, state, retrieved, archived, original, states, university. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: North Carolina - Wikipedia (en.wikipedia.org). Evidence: This article is about the U.S. state. For the former British colony, see; North Carolina (disambiguation); \"The Old North State\" redirects here. For the song, see; Location of North Carolina within the United States", "reference_sheet": "TOPIC MAP: carolina | north | state | retrieved | archived | original | states | university\nCORE FACTS/RULES:\n- Coordinates : 36°N 80°W ﻿ / ﻿ 36°N 80°W ﻿ / 36; -80 ﻿ ( State of North Carolina ) From Wikipedia, the free encyclopedia U.S.\n- For the former British colony, see Province of North Carolina .\n- For other uses, see North Carolina (disambiguation) .\n- For the song, see The Old North State (song) .\n- State in the United States North Carolina State Flag Seal Nicknames : The Tarheel State , The Old North State Motto(s) : Esse quam videri [ a ] \"To be, rather than to seem\" Anthem:\n- House delegation 10 Republicans 4 Democrats ( list ) Area • Total 53,819.2 sq mi (139,391.0 km 2 ) • Land 48,617.9 sq mi (125,919.8 km 2 ) • Water 5,201.3 sq mi (13,471.2 km 2 ) 9.\n- Latitude 33° 50′ N to 36° 35′ N Longitude 75° 28′ W to 84° 19′ W Website nc .gov State symbols of North Carolina List of state symbols Flag of North Carolina Seal of North Carolina\n- It is bordered by Virginia to the north, the Atlantic Ocean to the east, South Carolina to the south, Georgia to the southwest, and Tennessee to the west.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: The state is the 28th-largest and ninth-most populous of the United States .\n- Example seed: Along with South Carolina, it makes up the Carolinas region of the East Coast .\n- Example seed: At the 2020 census , the state had a population of 10,439,388.\n- Example seed: [ 9 ] Raleigh is the state's capital and Charlotte is its most populous and one of the fastest growing cities in the United States .\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: North Carolina - Wikipedia", "url": "https://en.wikipedia.org/wiki/North_Carolina", "title": "North Carolina - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, schools, education, students, retrieved, archived, original, learning. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: School - Wikipedia (en.wikipedia.org). Evidence: Institution for the education of students by teachers; \"Schooling\" redirects here. For other uses, see; (and, in the case of in-person learning, the; , usually under the direction of", "reference_sheet": "TOPIC MAP: school | schools | education | students | retrieved | archived | original | learning\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Institution for the education of students by teachers For other uses, see School (disambiguation) .\n- For other uses, see Schooling (disambiguation) .\n- First primary school in Nigeria , built in 1845 [ 1 ] A high school building in Argos, Greece A school is an educational institution (and, in the case of in-person learning, the bu\n- Most countries have systems of formal education , which is sometimes compulsory .\n- [ 2 ] In these systems, students progress through a series of schools that can be built and operated by both government and private organizations.\n- The names for these schools vary by country (discussed in the Regional terms section below) but generally include primary school for young children and secondary school for teenage\n- An institution where higher education is taught is commonly called a university college or university .\n- In addition to these core schools, students in a given country may also attend schools before and after primary (elementary in the U.S.) and secondary (middle school in the U.S.) e\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 3 ] Kindergarten or preschool provide some schooling to very young children (typically ages 3–5).\n- Example seed: University, vocational school , college , or seminary may be available after secondary school.\n- Example seed: A school may be dedicated to one particular field, such as a school of economics or dance.\n- Example seed: Alternative schools may provide nontraditional curriculum and methods.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: School - Wikipedia", "url": "https://en.wikipedia.org/wiki/School", "title": "School - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: university, florida, retrieved, central, original, archived, college, july. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: University of Central Florida - Wikipedia (en.wikipedia.org). Evidence: Public university in Orlando, Florida, US; \"UCF\" redirects here. For other uses, see; Florida Technological University (1966–1978); State University System of Florida", "reference_sheet": "TOPIC MAP: university | florida | retrieved | central | original | archived | college | july\nCORE FACTS/RULES:\n- Coordinates : 28°36′06″N 81°12′02″W ﻿ / ﻿ 28.6016°N 81.2005°W ﻿ / 28.6016; -81.2005 From Wikipedia, the free encyclopedia Public university in Orlando, Florida, US \"UCF\" redirects \n- Not to be confused with College of Central Florida .\n- University of Central Florida Former names Florida Technological University (1966–1978) Motto \"Reach for the Stars\" Type Public research university Established June 10, 1963 ; 62 y\n- Johnson Academic staff 1,963 (fall 2024) [ 2 ] Total staff 13,139 (fall 2024) [ 2 ] Students 69,818 (fall 2024) [ 2 ] Undergraduates 59,649 (fall 2024) [ 2 ] Postgraduates 10,169 (\n- [ 3 ] It is part of the State University System of Florida .\n- With 69,818 students as of the fall 2024 semester, UCF has the second largest on-campus student body of any public university in the United States .\n- UCF is classified among \"R1: Doctoral Universities – Very high research spending and doctorate production\" and is accredited by the Commission on Colleges of the Southern Associati\n- [ 2 ] UCF was founded in 1963 and opened its first classes in 1968 as Florida Technological University , with the mission to provide personnel educated in science, technology, engi\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: space program at the Kennedy Space Center and Cape Canaveral Space Force Station (known at the time as Cape Kennedy Air Force Station) on Florida's Space Coast \n- Example seed: [ 7 ] As its academic scope expanded beyond engineering and technology, Florida Tech was renamed the University of Central Florida in 1978.\n- Example seed: [ 8 ] UCF continues to have space root connections, as it developed and oversees the Florida Space Institute , Robinson Observatory , manages the National Astro\n- Example seed: [ 9 ] Initial enrollment in 1968 was 1,948 students; [ 10 ] enrollment in 2024 exceeds 68,000 students from 142 countries and all 50 states.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: University of Central Florida - Wikipedia", "url": "https://en.wikipedia.org/wiki/University_of_Central_Florida", "title": "University of Central Florida - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: university, washington, george, school, retrieved, archived, original, college. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: George Washington University - Wikipedia (en.wikipedia.org). Evidence: The George Washington University; Private university in Washington, D.C., US; The George Washington University; Columbian University (1873–1904)", "reference_sheet": "TOPIC MAP: university | washington | george | school | retrieved | archived | original | college\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia (Redirected from The George Washington University ) Private university in Washington, D.C., US The George Washington University Former names C\n- Campus Large city, 43 acres (17 ha) [ 4 ] Newspaper The GW Hatchet Colors Buff and blue [ 5 ] Nickname Revolutionaries Sporting affiliations NCAA Division I – A-10 CWPA EARC EAWRC \n- Originally named Columbian College , it was chartered in 1821 by the United States Congress and is the first university founded under Washington, D.C.'s jurisdiction.\n- It is one of only six federally chartered universities in the United States.\n- [ 7 ] [ 8 ] GW is classified among \"R1: Doctoral Universities – Very High Research Activity\".\n- [ 9 ] It is a member of the Association of American Universities .\n- [ 10 ] The university offers degree programs in seventy-one disciplines, enrolling around 11,500 undergraduate and 15,000 graduate students .\n- [ 11 ] The school's athletic teams, the George Washington Revolutionaries , play in the NCAA Division I Atlantic 10 Conference .\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: GW also annually hosts numerous political events, including the World Bank and International Monetary Fund 's Annual Meetings .\n- Example seed: [ 12 ] Several notable individuals have served as trustees, including two presidents, John Quincy Adams and Ulysses S.\n- Example seed: [ 13 ] GW has over 1,100 active alumni in the U.S.\n- Example seed: Foreign Service and is one of the largest feeder schools for the diplomatic corps .\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: George Washington University - Wikipedia", "url": "https://en.wikipedia.org/wiki/The_George_Washington_University", "title": "George Washington University - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, high, seaholm, detroit, michigan, schools, birmingham, academy. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Seaholm High School - Wikipedia (en.wikipedia.org). Evidence: High school in Michigan, United States; Oakland Activities Association; , United States. It was established in 1951 and is part of the; Seaholm opened in 1951 under the name Birmingham High School. At the time, the Board of Education President was", "reference_sheet": "TOPIC MAP: school | high | seaholm | detroit | michigan | schools | birmingham | academy\nCORE FACTS/RULES:\n- Coordinates : 42°32′20″N 83°14′41″W ﻿ / ﻿ 42.53889°N 83.24472°W ﻿ / 42.53889; -83.24472 From Wikipedia, the free encyclopedia High school in Michigan, United States Ernest W.\n- Seaholm High School Location 2436 West Lincoln Street Birmingham , Michigan 48009 United States Coordinates 42°32′20″N 83°14′41″W ﻿ / ﻿ 42.53889°N 83.24472°W ﻿ / 42.53889; -83.2447\n- prior year [ 3 ] M-STEP 11th grade proficiency rates (Science / Social Studies) Advanced % 32.1 / 18.0 Proficient % 34.3 / 40.9 PR.\n- Proficient % 13.0 / 32.8 Not Proficient % 20.7 / 8.4 Average test scores SAT Total 1300 ( +46.8) Ernest W.\n- Seaholm High School (simply referred to as Seaholm High School ) is a magnet high school in Birmingham, Michigan , United States.\n- It was established in 1951 and is part of the Birmingham Public Schools district.\n- History [ edit ] This section needs expansion .\n- ( June 2013 ) Seaholm opened in 1951 under the name Birmingham High School.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: At the time, the Board of Education President was Ernest W.\n- Example seed: Seaholm (retired Chief Engineer for Cadillac) [ 4 ] and the treasurer was Wylie E.\n- Example seed: Birmingham's two high schools are now named for them: Seaholm High School and Groves High School .\n- Example seed: Birmingham High School's first principal was Ross Wagner.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Seaholm High School - Wikipedia", "url": "https://en.wikipedia.org/wiki/Seaholm_High_School", "title": "Seaholm High School - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: ohio, university, state, retrieved, original, archived, college, research. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Ohio State University - Wikipedia (en.wikipedia.org). Evidence: Public university in Columbus, Ohio, US; This article is about the Columbus campus. For other campuses, see; Ohio State University (disambiguation); \"Ohio State\" redirects here. For the U.S. state, see", "reference_sheet": "TOPIC MAP: ohio | university | state | retrieved | original | archived | college | research\nCORE FACTS/RULES:\n- Coordinates : 40°00′00″N 83°00′45″W ﻿ / ﻿ 40.0000°N 83.0125°W ﻿ / 40.0000; -83.0125 From Wikipedia, the free encyclopedia Public university in Columbus, Ohio, US This article is ab\n- For other campuses, see Ohio State University (disambiguation) .\n- This article contains academic boosterism which primarily serves to praise or promote the subject and may be a sign of a conflict of interest .\n- Please improve this article by removing peacock terms , weasel words , and other promotional material .\n- ( February 2026 ) ( Learn how and when to remove this message ) The Ohio State University Former names Ohio Agricultural and Mechanical College (1870–1878) Motto Disciplina in civi\n- Bellamkonda Academic staff 7,310 [ 3 ] Administrative staff 27,158 [ 3 ] Students 60,046 (Columbus) 65,405 (all campuses) [ 4 ] Undergraduates 45,728 (Columbus) 51,078 (all campuse\n- Founded in 1870, it is the flagship institution of the University System of Ohio .\n- [ 7 ] It is designated a land-grant , [ 8 ] sea-grant , [ 9 ] and space-grant [ 10 ] university by the Government of Ohio .\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 11 ] Ohio State is one of the largest universities by enrollment in the United States, with over 50,000 undergraduate students and 15,000 graduate students.\n- Example seed: Ohio State is a member of the Association of American Universities and is classified among \" R1 : Doctoral Universities – Very high research activity spending a\n- Example seed: [ 12 ] In 2026 the university had research and development (R&D) expenditures of $1.58 billion, the 12th largest in the United States.\n- Example seed: [ 13 ] The university consists of sixteen colleges , including of Arts and Sciences , Business , Dentistry , Engineering , Public Affairs , and Law , and offers\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Ohio State University - Wikipedia", "url": "https://en.wikipedia.org/wiki/Ohio_State_University", "title": "Ohio State University - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: missouri, college, community, kansas, city, campus, valley, metropolitan. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Metropolitan Community College (Missouri) - Wikipedia (en.wikipedia.org). Evidence: Public college system in Missouri, US; Metropolitan Community College; Kansas City Polytechnic Institute; (as Kansas City Polytechnic Institute)", "reference_sheet": "TOPIC MAP: missouri | college | community | kansas | city | campus | valley | metropolitan\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia (Redirected from Penn Valley Community College ) Public college system in Missouri, US Metropolitan Community College Penn Valley campus Forme\n- Chawana Total staff 1,000 Students 13,178 (2023) Location Missouri , United States Campus 550 acres (220 ha) (total) Language English Colors Royal blue and white Nickname Wolves We\n- The system consists of four physical campuses in Kansas City , Independence , and Lee's Summit , as well as the MCC-Online campus.\n- The campuses had a total enrollment of 13,376 for the fall semester of 2023.\n- [ 1 ] The college's athletic teams are known as the Wolves.\n- It is not affiliated with Metropolitan Community College in Omaha, Nebraska.\n- History [ edit ] MCC is the oldest public college in Kansas City, Missouri, and the first community college established in the state of Missouri.\n- It was founded in 1915 as Kansas City Polytechnic Institute, with its campus at 11th and Locust streets initially offering a junior college program, a teacher training school, a hi\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: As a junior college, it was one of the first institutions in the country to issue two-year associate degrees, and it was the third school in the country to be a\n- Example seed: It changed its name to Junior College of Kansas City in 1919.\n- Example seed: [ 2 ] In 1964 the suburban school districts of Belton, Center, Grandview, Hickman Mills, Lee's Summit, North Kansas City, and Raytown joined the Kansas City dis\n- Example seed: A Board of Trustees was publicly elected to take over fiduciary responsibility for the college from the Kansas City School District.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Metropolitan Community College (Missouri) - Wikipedia", "url": "https://en.wikipedia.org/wiki/Penn_Valley_Community_College", "title": "Metropolitan Community College (Missouri) - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: arizona, university, retrieved, archived, original, college, tucson, february. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: University of Arizona - Wikipedia (en.wikipedia.org). Evidence: Public university in Tucson, Arizona, US; , United States. Founded in 1885 by the; 13th Arizona Territorial Legislature; , it was the first university established in the", "reference_sheet": "TOPIC MAP: arizona | university | retrieved | archived | original | college | tucson | february\nCORE FACTS/RULES:\n- Coordinates : 32°13′55″N 110°57′10″W ﻿ / ﻿ 32.2319°N 110.9527°W ﻿ / 32.2319; -110.9527 From Wikipedia, the free encyclopedia Public university in Tucson, Arizona, US Not to be conf\n- University of Arizona Latin : Universitas Arizonensis [ 1 ] [ 2 ] Motto Sursum [ 1 ] [ 2 ] Motto in English \"Upwards\" [ 3 ] [ 1 ] [ 2 ] Type Public land-grant research university E\n- Prelock [ 7 ] Academic staff 3,374 (fall 2025) [ 8 ] Total staff 15,764 (fall 2025) [ 9 ] Students 54,384 (fall 2025) [ 10 ] Undergraduates 43,294 (fall 2025) [ 10 ] Postgraduates \n- Wildcat Website arizona.edu The University of Arizona ( Arizona , U of A , UArizona , or UA ) is a public land-grant research university in Tucson, Arizona , United States.\n- Founded in 1885 by the 13th Arizona Territorial Legislature , it was the first university established in the Arizona Territory .\n- The University of Arizona is one of three universities governed by the Arizona Board of Regents (the University of Arizona, Arizona State University , and Northern Arizona Universi\n- As of fall 2025 [update] , the university enrolled 54,384 students in 22 separate colleges/schools, including the Eller College of Management , the Wyant College of Optical Science\n- [ 14 ] The university is classified among \"R1: Doctoral Universities – Very high research activity\".\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: UA also is a member of the Association of American Universities .\n- Example seed: The University of Arizona is affiliated with two academic medical centers, Banner – University Medical Center Tucson and Banner – University Medical Center Phoe\n- Example seed: Known as the Arizona Wildcats (often shortened to \"Cats\"), the UA's intercollegiate athletic teams were members of the Pac-12 Conference of the NCAA .\n- Example seed: The university joined the Big 12 Conference on August 2, 2024.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: University of Arizona - Wikipedia", "url": "https://en.wikipedia.org/wiki/University_of_Arizona", "title": "University of Arizona - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, harriton, high, merion, pennsylvania, lower, academy, schools. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Harriton High School - Wikipedia (en.wikipedia.org). Evidence: This article has multiple issues.; or discuss these issues on the; Learn how and when to remove these messages; needs additional citations for", "reference_sheet": "TOPIC MAP: school | harriton | high | merion | pennsylvania | lower | academy | schools\nCORE FACTS/RULES:\n- Coordinates : 40°02′28″N 75°19′01″W ﻿ / ﻿ 40.041°N 75.317°W ﻿ / 40.041; -75.317 From Wikipedia, the free encyclopedia This article has multiple issues.\n- Please help improve it or discuss these issues on the talk page .\n- ( Learn how and when to remove these messages ) This article needs additional citations for verification .\n- Please help improve this article by adding citations to reliable sources .\n- Unsourced material may be challenged and removed.\n- Find sources: \"Harriton High School\" – news · newspapers · books · scholar · JSTOR ( June 2013 ) ( Learn how and when to remove this message ) This article contains promotional con\n- Please help improve it by removing promotional language and inappropriate external links , and by adding encyclopedic text written from a neutral point of view .\n- See our advice if the article is about you and read our scam warning in case someone asks for money to edit this article.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: ( October 2016 ) ( Learn how and when to remove this message ) ( Learn how and when to remove this message ) High school in Rosemont, Pennsylvania, United State\n- Example seed: The school is located on the Philadelphia Main Line .\n- Example seed: Harriton is one of two high schools in the Lower Merion School District , with the other being Lower Merion High School .\n- Example seed: History [ edit ] Harriton High School is situated on a portion of the plantation grounds belonging to Charles Thomson , son-in-law of Richard and Hannah Harriso\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Harriton High School - Wikipedia", "url": "https://en.wikipedia.org/wiki/Harriton_High_School", "title": "Harriton High School - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, high, troy, fullerton, retrieved, edit, student, california. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Troy High School (California) - Wikipedia (en.wikipedia.org). Evidence: Public high school in Fullerton, California, United States; Fullerton Joint Union High School District; Western Association of Schools and Colleges; , U.S., acclaimed for its many programs including the flagship Troy Tech,", "reference_sheet": "TOPIC MAP: school | high | troy | fullerton | retrieved | edit | student | california\nCORE FACTS/RULES:\n- Coordinates : 33°52′53″N 117°53′34″W ﻿ / ﻿ 33.88139°N 117.89278°W ﻿ / 33.88139; -117.89278 From Wikipedia, the free encyclopedia Public high school in Fullerton, California, United\n- The school is part of the Fullerton Joint Union High School District .\n- As of the 2022–23 school year, 2,584 students attend the school.\n- The school is located next to the continuing La Vista High School and California State University, Fullerton .\n- Academics [ edit ] This section needs additional citations for verification .\n- Please help improve this article by adding citations to reliable sources in this section.\n- Unsourced material may be challenged and removed.\n- ( July 2019 ) ( Learn how and when to remove this message ) In the late 1980s and early 1990s, then-principal Jerry Atkin was instrumental in developing and implementing a Science \nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 7 ] This program involves technology pathways with specialized courses as well as an internship students must complete the summer after junior year.\n- Example seed: Troy was one of 27 high schools nationwide honored as a New American High School by former U.S.\n- Example seed: National Science Olympiad in 1996, 1999, 2000, 2002, 2003, 2006, 2007, 2008, 2014, 2015, 2017, 2018 and 2019 and has also placed favorably in many other competi\n- Example seed: Troy's Science Olympiad team has consistently attended nationals every year since 1994 except for 1995, and they have placed in the top 5 at nationals every yea\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Troy High School (California) - Wikipedia", "url": "https://en.wikipedia.org/wiki/Troy_High_School_(California)", "title": "Troy High School (California) - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: solon, school, high, retrieved, august, band, ohio, national. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Solon High School - Wikipedia (en.wikipedia.org). Evidence: Public high school in Solon, Ohio; It comprises grades 9 through 12 and is the only high school in the; , which also includes Solon and Orchard Middle Schools, three elementary schools: Lewis, Parkside and Roxbury, and a preschool, Regano. Solon High School's student body is approximately 1,500 students while the faculty roster includes approximately 200 teachers, administrators, and staff.; Erin Short currently serves as principal.", "reference_sheet": "TOPIC MAP: solon | school | high | retrieved | august | band | ohio | national\nCORE FACTS/RULES:\n- Coordinates : 41°22′39″N 81°26′26″W ﻿ / ﻿ 41.37750°N 81.44056°W ﻿ / 41.37750; -81.44056 From Wikipedia, the free encyclopedia Public high school in Solon, Ohio Solon High School So\n- It comprises grades 9 through 12 and is the only high school in the Solon City School District , which also includes Solon and Orchard Middle Schools, three elementary schools: Lew\n- Solon High School's student body is approximately 1,500 students while the faculty roster includes approximately 200 teachers, administrators, and staff.\n- [ 3 ] Erin Short currently serves as principal.\n- [ 4 ] As of 2024, Solon's student body is 53% White, 22% Asian or Pacific Islander, 17% Black, 5% Two or more races, and 3% Hispanic.\n- Academics [ edit ] Solon High School Solon High School and the entire Solon City School District consistently rank among the best schools in Ohio.\n- [ 5 ] In 2021, the Solon School District was named the best Public School District in America by the community and academic rating organization Niche.com.\n- That same year, Solon High School was listed as #181 on Niche 's list of America's Best Public High Schools and #3 Best Public High School in Ohio.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 6 ] The school was given a Gold Ranking and listed as #211 by U.S.\n- Example seed: [ 7 ] Solon High School is one of few schools to have received Blue Ribbon awards twice, both in 1991 and 2009.\n- Example seed: [ 8 ] [ 9 ] Solon High School students are perennially recognized by the National Merit Scholarship Program .\n- Example seed: The class of 2021 had 19 Solon High School students named as National Merit Finalists and 14 Commended Students, while the class of 2022 had 34 Semi-Finalists a\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Solon High School - Wikipedia", "url": "https://en.wikipedia.org/wiki/Solon_High_School", "title": "Solon High School - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: university, chicago, retrieved, school, archived, original, college, september. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: University of Chicago - Wikipedia (en.wikipedia.org). Evidence: Private university in Chicago, Illinois, US; University of Illinois Chicago; Crescat scientia; vita excolatur; \"Let knowledge grow from more to more; and so be human life enriched\"", "reference_sheet": "TOPIC MAP: university | chicago | retrieved | school | archived | original | college | september\nCORE FACTS/RULES:\n- Coordinates : 41°47′23″N 87°35′59″W ﻿ / ﻿ 41.78972°N 87.59972°W ﻿ / 41.78972; -87.59972 From Wikipedia, the free encyclopedia Private university in Chicago, Illinois, US Not to be \n- University of Chicago Motto Crescat scientia; vita excolatur ( Latin ) Motto in English \"Let knowledge grow from more to more; and so be human life enriched\" Type Private research \n- Rockefeller Accreditation HLC Academic affiliations AAU NAICU URA Endowment $10.6 billion (2025) [ 1 ] President Paul Alivisatos Academic staff 3,418 (2023) Administrative staff 23\n- The university is composed of an undergraduate college and four graduate research divisions : the Arts & Humanities Division, the Biological Sciences Division, the Physical Science\n- In addition, the university operates seven professional schools in the fields of business , social work , theology , public policy , law , medicine , and molecular engineering , an\n- The university maintains satellite campuses and centers in London, Hong Kong , Paris, Beijing, Delhi, Luxor, and downtown Chicago.\n- University of Chicago scholars have played a role in the development of many academic disciplines, including economics, law, literary criticism, mathematics, physics, religion, soc\n- The university's Metallurgical Laboratory produced the world's first human-made, self-sustaining nuclear reaction in Chicago Pile-1 beneath the viewing stands of the university's S\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Advances in chemistry led to the \"radiocarbon revolution\" in the carbon-14 dating of ancient life and objects.\n- Example seed: The university research efforts include administration of the Fermi National Accelerator Laboratory and the Argonne National Laboratory , as well as the Marine \n- Example seed: The university is also home to the University of Chicago Press , the largest university press in North America.\n- Example seed: As of 2025, the university's students, faculty, and staff have included 101 Nobel laureates .\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: University of Chicago - Wikipedia", "url": "https://en.wikipedia.org/wiki/University_of_Chicago", "title": "University of Chicago - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, high, retrieved, archived, york, class, girls, state. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Fayetteville–Manlius High School - Wikipedia (en.wikipedia.org). Evidence: Fayetteville-Manlius High School; High school in Manlius, New York; Fayetteville-Manlius High School; Fayetteville-Manlius Central School District", "reference_sheet": "TOPIC MAP: school | high | retrieved | archived | york | class | girls | state\nCORE FACTS/RULES:\n- Coordinates : 43°00′33″N 75°57′36″W ﻿ / ﻿ 43.009167°N 75.96°W ﻿ / 43.009167; -75.96 From Wikipedia, the free encyclopedia (Redirected from Fayetteville-Manlius High School ) High s\n- It is the only high school in the district, and is the successor to both Wellwood Middle School and Eagle Hill Middle School .\n- The school is governed under the authority of the New York State Education Department , whose standardized examinations are designed and administered by the Board of Regents of the\n- History [ edit ] Fayetteville–Manlius High School was opened in 1963 after the 1951 merger of then separate Fayetteville and Manlius school districts and subsequent need to consoli\n- Upon this opening, a major school restructuring was implemented, as the Fayetteville High School became Wellwood Middle School and Manlius High School became Pleasant Street Elemen\n- A new middle school , Eagle Hill , was also opened directly next to the high school in 1965.\n- Space requirements, due mainly to ballooning enrollment and continued reorganization as a result of the 1951 merger, prompted the district to relocate Eagle Hill to a new building \n- This expansion, which connected the two buildings, now called House 2 and House 1, by a hallway and an enclosed footbridge, nearly doubled the school's footprint.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: F-M High School served grades 12 through 10 until 1976, when the two junior high schools became middle schools, and FM High took in 9th graders.\n- Example seed: [ 2 ] Administration [ edit ] Former principal of Mott Road Elementary School and vice principal of Fayetteville–Manlius High School itself, Patrick McNamara wa\n- Example seed: Kilmer, III (now superintendent of Oswego City School District ), and legally began his reign on July 1, 2024.\n- Example seed: [ 3 ] Traditions [ edit ] Many of the school's traditions stem from the fact that decades ago, hornets nested in a 200-year-old oak tree that formerly stood on \nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Fayetteville–Manlius High School - Wikipedia", "url": "https://en.wikipedia.org/wiki/Fayetteville-Manlius_High_School", "title": "Fayetteville–Manlius High School - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, district, west, windsor-plainsboro, schools, regional, high, jersey. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: West Windsor-Plainsboro Regional School District - Wikipedia (en.wikipedia.org). Evidence: School district in Mercer County, New Jersey, US; West Windsor-Plainsboro Regional School District; District's main office building; 2014 Taxpayers' Guide to Education Spending.", "reference_sheet": "TOPIC MAP: school | district | west | windsor-plainsboro | schools | regional | high | jersey\nCORE FACTS/RULES:\n- Coordinates : 40°16′56″N 74°36′51″W ﻿ / ﻿ 40.282351°N 74.614212°W ﻿ / 40.282351; -74.614212 From Wikipedia, the free encyclopedia (Redirected from Community Middle School ) School \n- Per pupil District spending Rank (*) K-12 average %± vs.\n- average 1A Total Spending $17,321 33 $18,891 −8.3% 1 Budgetary Cost 13,701 37 14,783 −7.3% 2 Classroom Instruction 8,580 48 8,763 −2.1% 6 Support Services 1,983 30 2,392 −17.1% 8 A\n- [ 2 ] *Of K-12 districts with more than 3,500 students.\n- Lowest spending=1; Highest=103 The West Windsor-Plainsboro Regional School District is a comprehensive high achieving regional public school district in the U.S.\n- state of New Jersey , serving students in pre-kindergarten through twelfth grade from West Windsor Township (in Mercer County ) and Plainsboro Township (in Middlesex County ).\n- [ 3 ] There are four elementary schools (grades PreK/K - 3), two upper elementary schools (grades 4 and 5), two middle schools (grades 6 - 8) and two high schools (grades 9 - 12).\n- [ 4 ] Niche.com listed the district as fifth best in New Jersey, and 73rd best in the nation, according to its 2025 Best Schools ranking.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 5 ] As of the 2020–21 school year, the district, comprising 10 schools, had an enrollment of 9,386 students and 773.2 classroom teachers (on an FTE basis), fo\n- Example seed: [ 1 ] The district is classified by the New Jersey Department of Education as being in District Factor Group \"J\", the highest of eight groupings.\n- Example seed: District Factor Groups organize districts statewide to allow comparison by common socioeconomic characteristics of the local districts.\n- Example seed: From lowest socioeconomic status to highest, the categories are A, B, CD, DE, FG, GH, I and J.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: West Windsor-Plainsboro Regional School District - Wikipedia", "url": "https://en.wikipedia.org/wiki/Community_Middle_School", "title": "West Windsor-Plainsboro Regional School District - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: augusta, university, georgia, state, college, school, system, arsenal. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Augusta State University - Wikipedia (en.wikipedia.org). Evidence: Public university in Augusta, Georgia, US; This article is about the historical university that existed in Augusta, Georgia, from 1996–2012. For the current university that grew out it, see; William A. Bloodworth Jr. (last president, 1993–2012); . It merged with Georgia Health Sciences University in 2012 to form Georgia Regents University, later known as", "reference_sheet": "TOPIC MAP: augusta | university | georgia | state | college | school | system | arsenal\nCORE FACTS/RULES:\n- Coordinates : 33°28′36″N 82°01′23″W ﻿ / ﻿ 33.4768°N 82.0230°W ﻿ / 33.4768; -82.0230 From Wikipedia, the free encyclopedia Public university in Augusta, Georgia, US This article is \n- For the current university that grew out it, see Augusta University .\n- Augusta State University Former names Augusta College Type Public university Active January 27, 1785 ( 1785-01-27 ) –August 10, 2012 ( 2012-08-10 ) President William A.\n- Kenny (interim, July–December 2012) Academic staff 200 Administrative staff 300 Students 6,919 [ 1 ] Undergraduates 5,628 [ 1 ] Postgraduates 960 [ 1 ] Location Augusta, Georgia , \n- 33°28′36″N 82°01′23″W ﻿ / ﻿ 33.4768°N 82.0230°W ﻿ / 33.4768; -82.0230 Campus Urban Colors Blue & white Sporting affiliations NCAA Division II Peach Belt Conference Mascot Jaguars W\n- It merged with Georgia Health Sciences University in 2012 to form Georgia Regents University, later known as Augusta University .\n- History [ edit ] Augusta State University was founded as a high school named Academy of Richmond County in 1783.\n- It opened in 1785 and offered collegiate-level classes from its earliest days, and its classes were overseen by the Georgia state legislature .\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Graduates were accepted into colleges as sophomores or juniors.\n- Example seed: Operation of the academy was overseen by a board of trustees until 1909, when control was passed to the Augusta Board of Education.\n- Example seed: The college-level classes continued to be overseen by a committee of the state legislature.\n- Example seed: As enrollment increased, land for a new building was purchased.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Augusta State University - Wikipedia", "url": "https://en.wikipedia.org/wiki/Augusta_State_University", "title": "Augusta State University - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: wisconsin, university, retrieved, madison, archived, original, school, state. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: University of Wisconsin–Madison - Wikipedia (en.wikipedia.org). Evidence: Public university in Madison, Wisconsin, US; \"University of Wisconsin\" redirects here. For the state university system, see; University of Wisconsin System; University of Wisconsin (disambiguation)", "reference_sheet": "TOPIC MAP: wisconsin | university | retrieved | madison | archived | original | school | state\nCORE FACTS/RULES:\n- Coordinates : 43°04′31″N 89°24′15″W ﻿ / ﻿ 43.0753°N 89.4042°W ﻿ / 43.0753; -89.4042 From Wikipedia, the free encyclopedia Public university in Madison, Wisconsin, US \"University of\n- For the state university system, see University of Wisconsin System .\n- For other uses, see University of Wisconsin (disambiguation) .\n- University of Wisconsin–Madison Former names University of Wisconsin (1848–1971) Motto Numen Lumen [ 1 ] ( Latin ) Motto in English \"The divine within the universe, however manifes\n- Mnookin Provost John Zumbrunnen (interim) Academic staff 2,220 [ 3 ] Total staff 24,232 [ 4 ] Students 48,557 (2024) [ 4 ] Undergraduates 34,212 (2024) [ 4 ] Postgraduates 14,345 (\n- It was founded in 1848 when Wisconsin achieved statehood and is the flagship campus of the University of Wisconsin System .\n- The 933-acre (378 ha) main campus is located on the shores of Lake Mendota ; the university also owns and operates a 1,200-acre (486 ha) arboretum 4 miles (6.4 km) south of the mai\n- UW–Madison is organized into 13 schools and colleges, which enrolled approximately 34,200 undergraduate and 14,300 graduate and professional students in 2024.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 4 ] Its academic programs include 136 undergraduate majors, 148 master's degree programs, and 120 doctoral programs.\n- Example seed: Wisconsin is one of the founding members of the Association of American Universities and is classified among \"R1: Doctoral Universities – Very High Research Act\n- Example seed: [ 7 ] UW–Madison was also the home of both the prominent \"Wisconsin School\" of economics and diplomatic history .\n- Example seed: universities in research expenditures in 2023, according to the National Science Foundation .\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: University of Wisconsin–Madison - Wikipedia", "url": "https://en.wikipedia.org/wiki/University_of_Wisconsin%E2%80%93Madison", "title": "University of Wisconsin–Madison - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, mira, loma, high, students, california, edit, club. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Mira Loma High School - Wikipedia (en.wikipedia.org). Evidence: School in Sacramento, California, United States; San Juan Unified School District; Columbia Blue, Scarlet Red & White; is a public high school located in", "reference_sheet": "TOPIC MAP: school | mira | loma | high | students | california | edit | club\nCORE FACTS/RULES:\n- Coordinates : 38°37′59″N 121°22′16″W ﻿ / ﻿ 38.63306°N 121.37111°W ﻿ / 38.63306; -121.37111 From Wikipedia, the free encyclopedia School in Sacramento, California, United States Mir\n- It is located south of Interstate 80 , and east of Watt Avenue.\n- It is a part of the San Juan Unified School District with a student body of approximately 1700 students from northeast Arden-Arcade and western Carmichael .\n- Mira Loma High School has been an IB World School since 1989, and is the largest International Baccalaureate program in Northern California.\n- [ 3 ] Mira Loma also achieves consistently high pass rates for IB exams, taken as part of the May session.\n- According to Mira Loma, in 1996–1997 the school had a pass rate of 93%, with a 100% diploma attainment rate for students.\n- [ 4 ] In 2007–2008 the pass rate was 93% with a 100% diploma attainment rate.\n- [ 5 ] Both statistics are well above both the North American average (78%) and the world average (81%) for diploma attainment.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: For the 2015–2016 school year, Mira Loma has the highest average SAT score in the Sacramento area.\n- Example seed: [ 6 ] Education [ edit ] Mira Loma offers a large number of International Baccalaureate courses that prepare students for IB examinations every spring.\n- Example seed: The IB tests are either Standard Level (SL) or Higher Level (HL) based on the amount of coursework prior to the examination.\n- Example seed: Mira Loma students tested in 18 different IB subjects in 2016.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Mira Loma High School - Wikipedia", "url": "https://en.wikipedia.org/wiki/Mira_Loma_High_School", "title": "Mira Loma High School - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: cornell, university, retrieved, college, york, original, campus, archived. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Cornell University - Wikipedia (en.wikipedia.org). Evidence: Private university in Ithaca, New York; \"Cornell\" redirects here. For the private liberal arts college in Iowa, see; For the private college in Ithaca, New York, see; \"I would found an institution where any person can find instruction in any study\"", "reference_sheet": "TOPIC MAP: cornell | university | retrieved | college | york | original | campus | archived\nCORE FACTS/RULES:\n- Coordinates : 42°26′57″N 76°29′02″W ﻿ / ﻿ 42.4492°N 76.4839°W ﻿ / 42.4492; -76.4839 From Wikipedia, the free encyclopedia Private university in Ithaca, New York \"Cornell\" redirects\n- For the private liberal arts college in Iowa, see Cornell College .\n- For other uses, see Cornell (disambiguation) .\n- For the private college in Ithaca, New York, see Ithaca College .\n- Cornell University Latin : Universitas Cornelliana [ 1 ] Motto \"I would found an institution where any person can find instruction in any study\" [ 2 ] [ 3 ] Type Private [ 4 ] land\n- [ 4 ] The university was co-founded by American philanthropist Ezra Cornell and historian and educator Andrew Dickson White in 1865.\n- Since its founding, Cornell University has been a co-educational and nonsectarian institution.\n- As of fall 2024, the student body included 16,128 undergraduate and 10,665 postgraduate students from all 50 U.S.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 7 ] The university is organized into eight undergraduate colleges and seven graduate divisions on its main Ithaca campus.\n- Example seed: [ 12 ] Each college and academic division has near autonomy in defining its respective admission standards and academic curriculum.\n- Example seed: In addition to its primary campus in Ithaca, Cornell University administers three satellite campuses, including two in New York City, the medical school and Cor\n- Example seed: [ 12 ] Cornell is one of three private land-grant universities in the United States.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Cornell University - Wikipedia", "url": "https://en.wikipedia.org/wiki/Cornell_University", "title": "Cornell University - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: caltech, retrieved, california, institute, archived, technology, original, university. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: California Institute of Technology - Wikipedia (en.wikipedia.org). Evidence: Private university in Pasadena, California; California Institute of Technology; Throop Polytechnic Institute and Manual Training School (1907–1913); Throop College of Technology (1913–1920)", "reference_sheet": "TOPIC MAP: caltech | retrieved | california | institute | archived | technology | original | university\nCORE FACTS/RULES:\n- Coordinates : 34°08′15″N 118°07′30″W ﻿ / ﻿ 34.13750°N 118.12500°W ﻿ / 34.13750; -118.12500 From Wikipedia, the free encyclopedia Private university in Pasadena, California Californ\n- Throop Accreditation WSCUC Academic affiliations AAU AITU APRU COFHE URA Space-grant Endowment $4.7 billion (2024) [ 3 ] President Thomas Rosenbaum Provost David A.\n- Tirrell Academic staff 300 professorial faculty [ 4 ] Students 2,430 (2024–25) Undergraduates 987 (2024–25) [ 5 ] Postgraduates 1,443 (2024–25) [ 5 ] Location Pasadena , California\n- The university is responsible for many modern scientific advancements and is among a small group of institutes of technology in the United States that are devoted to the instructio\n- [ 10 ] [ 11 ] The institution was founded as a preparatory and vocational school by Amos G.\n- Throop in 1891 and began attracting influential scientists such as George Ellery Hale , Arthur Amos Noyes , and Robert Andrews Millikan in the early 20th century.\n- The vocational and preparatory schools were disbanded and spun off in 1910, and the college assumed its present name in 1920.\n- In 1934, Caltech was elected to the Association of American Universities , and the antecedents of NASA 's Jet Propulsion Laboratory , which Caltech continues to manage and operate,\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 12 ] [ 13 ] Caltech has six academic divisions with strong emphasis on science and engineering, managing $332 million in research grants as of 2010.\n- Example seed: [ 14 ] Its 124-acre (50 ha) primary campus is located approximately 11 mi (18 km) northeast of downtown Los Angeles , in Pasadena.\n- Example seed: First-year students are required to live on campus, and 95% of undergraduates remain in the on-campus housing system at Caltech .\n- Example seed: Students agree to abide by an honor code which allows faculty to assign take-home examinations .\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: California Institute of Technology - Wikipedia", "url": "https://en.wikipedia.org/wiki/California_Institute_of_Technology", "title": "California Institute of Technology - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, stevenson, high, retrieved, august, state, original, illinois. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Stevenson High School (Lincolnshire, Illinois) - Wikipedia (en.wikipedia.org). Evidence: Secondary school in the United States; Adlai E. Stevenson High School; 1 Stevenson Drive, Lincolnshire, IL; Adlai E. Stevenson High School District 125", "reference_sheet": "TOPIC MAP: school | stevenson | high | retrieved | august | state | original | illinois\nCORE FACTS/RULES:\n- Coordinates : 42°11′57″N 87°56′44″W ﻿ / ﻿ 42.1993°N 87.9455°W ﻿ / 42.1993; -87.9455 From Wikipedia, the free encyclopedia Secondary school in the United States Adlai E.\n- Stevenson High School Location 1 Stevenson Drive, Lincolnshire, IL Lincolnshire , IL 60069 United States Coordinates 42°11′57″N 87°56′44″W ﻿ / ﻿ 42.1993°N 87.9455°W ﻿ / 42.1993; -8\n- Stevenson High School District 125 Superintendent Eric Twadell [ 1 ] Principal Troy Gobble [ 1 ] Faculty 281.60 (on FTE basis) [ 2 ] Grades 9–12 Enrollment 4,719 (2024–2025) [ 2 ] \n- Stevenson High School ( AESHS ), commonly called Stevenson High School ( SHS ), is a four-year public high school located in Lincolnshire, Illinois , United States.\n- Stevenson II , the 31st Governor of Illinois .\n- [ 4 ] History [ edit ] This section needs additional citations for verification .\n- Please help improve this article by adding citations to reliable sources in this section.\n- Unsourced material may be challenged and removed.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: ( August 2017 ) ( Learn how and when to remove this message ) In 1964, growing disagreement between the western (Lake Zurich) and eastern (current Stevenson) se\n- Example seed: Before the opening of Stevenson, the students in the Stevenson area attended Ela-Vernon High School in Lake Zurich.\n- Example seed: Stevenson was planned to be a second school for the growing district, but the western side (Lake Zurich) of the district decided to build their own district.\n- Example seed: Stevenson High School opened in September 1965.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Stevenson High School (Lincolnshire, Illinois) - Wikipedia", "url": "https://en.wikipedia.org/wiki/Stevenson_High_School_(Lincolnshire,_Illinois)", "title": "Stevenson High School (Lincolnshire, Illinois) - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: district, school, houston, high, katy, region, fort, texas. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Seven Lakes High School - Wikipedia (en.wikipedia.org). Evidence: Public school in Katy address, Texas, United States; Katy Independent School District; Beckendorff Junior High School; Seven Lakes Junior High School", "reference_sheet": "TOPIC MAP: district | school | houston | high | katy | region | fort | texas\nCORE FACTS/RULES:\n- Coordinates : 29°42′26″N 95°48′28″W ﻿ / ﻿ 29.707288°N 95.807911°W ﻿ / 29.707288; -95.807911 From Wikipedia, the free encyclopedia Public school in Katy address, Texas, United State\n- [ 2 ] Yearbook The Odyssey Feeder schools Beckendorff Junior High School Seven Lakes Junior High School Website www .katyisd .org /SLHS Seven Lakes High School ( SLHS ) is a public\n- [ 3 ] Many communities such as Seven Meadows, Grand Lakes, and Cinco Ranch are zoned to the school.\n- While the school has a Katy address, it is within the extraterritorial jurisdiction of Houston , and is a high school of the Katy Independent School District (KISD).\n- History [ edit ] The school was originally planned by Katy ISD to relieve overcrowding at Cinco Ranch High School and Katy High School and to better facilitate the influx of studen\n- The school plan was the same general design used for two other KISD schools, Morton Ranch High School and Cinco Ranch High School , and was designed by PBK Architects .\n- The school's first year in operation was the 2005–2006 school year and had its first graduating class of 408 students in the 2007–2008 school year.\n- [ 4 ] The school was nominated a \" National Blue Ribbon School of 2008.\" [ 5 ] COVID-19 [ edit ] In March 2020, in accordance with the rest of the schools in the Katy Independent S\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 6 ] On April 17, the school was shut down for the rest of the academic school year in accordance with Gov.\n- Example seed: [ 7 ] Virtual learning was put in place using Canvas , and was extended throughout the 2020-2021 school year during which two options were offered for returning\n- Example seed: The first involved in-person instruction, combining face-to-face teaching with digital learning through Canvas, including daily attendance tracking.\n- Example seed: The second option, the Katy Virtual Academy (KVA), offered real-time, live instruction via Canvas , allowing students to follow the KISD curriculum and meet Tex\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Seven Lakes High School - Wikipedia", "url": "https://en.wikipedia.org/wiki/Seven_Lakes_High_School", "title": "Seven Lakes High School - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: school, high, retrieved, archived, york, class, girls, state. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Fayetteville–Manlius High School - Wikipedia (en.wikipedia.org). Evidence: High school in Manlius, New York; Fayetteville-Manlius High School; Fayetteville-Manlius Central School District; Fayetteville–Manlius High School", "reference_sheet": "TOPIC MAP: school | high | retrieved | archived | york | class | girls | state\nCORE FACTS/RULES:\n- Coordinates : 43°00′33″N 75°57′36″W ﻿ / ﻿ 43.009167°N 75.96°W ﻿ / 43.009167; -75.96 From Wikipedia, the free encyclopedia High school in Manlius, New York Fayetteville-Manlius High\n- It is the only high school in the district, and is the successor to both Wellwood Middle School and Eagle Hill Middle School .\n- The school is governed under the authority of the New York State Education Department , whose standardized examinations are designed and administered by the Board of Regents of the\n- History [ edit ] Fayetteville–Manlius High School was opened in 1963 after the 1951 merger of then separate Fayetteville and Manlius school districts and subsequent need to consoli\n- Upon this opening, a major school restructuring was implemented, as the Fayetteville High School became Wellwood Middle School and Manlius High School became Pleasant Street Elemen\n- A new middle school , Eagle Hill , was also opened directly next to the high school in 1965.\n- Space requirements, due mainly to ballooning enrollment and continued reorganization as a result of the 1951 merger, prompted the district to relocate Eagle Hill to a new building \n- This expansion, which connected the two buildings, now called House 2 and House 1, by a hallway and an enclosed footbridge, nearly doubled the school's footprint.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: F-M High School served grades 12 through 10 until 1976, when the two junior high schools became middle schools, and FM High took in 9th graders.\n- Example seed: [ 2 ] Administration [ edit ] Former principal of Mott Road Elementary School and vice principal of Fayetteville–Manlius High School itself, Patrick McNamara wa\n- Example seed: Kilmer, III (now superintendent of Oswego City School District ), and legally began his reign on July 1, 2024.\n- Example seed: [ 3 ] Traditions [ edit ] Many of the school's traditions stem from the fact that decades ago, hornets nested in a 200-year-old oak tree that formerly stood on \nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Fayetteville–Manlius High School - Wikipedia", "url": "https://en.wikipedia.org/wiki/Fayetteville%E2%80%93Manlius_High_School", "title": "Fayetteville–Manlius High School - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: bibcode, page, reference, data, edit, code, journal, number. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Bibcode - Wikipedia (en.wikipedia.org). Evidence: Code used to identify references in certain astronomical data systems; ) is a compact identifier used by several astronomical data systems to uniquely specify literature references.; The Bibliographic Reference Code (refcode) was originally; NASA/IPAC Extragalactic Database", "reference_sheet": "TOPIC MAP: bibcode | page | reference | data | edit | code | journal | number\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia (Redirected from Bibcode (identifier) ) Code used to identify references in certain astronomical data systems The bibcode (also known as the r\n- Adoption [ edit ] The Bibliographic Reference Code (refcode) was originally [ when?\n- ] developed to be used in SIMBAD and the NASA/IPAC Extragalactic Database (NED), but it became a de facto standard and is now used more widely, for example, by the NASA Astrophysic\n- [ 1 ] [ 2 ] Format [ edit ] The code has a fixed length of 19 characters and has the form YYYYJJJJJVVVVMPPPPA where YYYY is the four-digit year of the reference and JJJJJ is a code\n- In the case of a journal reference, VVVV is the volume number, M indicates the section of the journal where the reference was published (e.g., L for a letters section), PPPP gives \n- ) are used to fill unused fields and to pad fields out to their fixed length if too short; padding is done on the right for the publication code and on the left for the volume numb\n- [ 1 ] [ 2 ] Page numbers greater than 9999 are continued in the M column.\n- The 6-digit article ID numbers (in lieu of page numbers) used by the Physical Review publications since the late 1990s are treated as follows: The first two digits of the article I\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: The remaining four digits are used in the page field.\n- Example seed: [ 2 ] As many publishers are moving away from page numbers and using electronic identifiers more and more frequently, the page field is no longer guaranteed to \n- Example seed: Often an identifier of more than 5 digits is truncated, and there may be letters, periods, dashes, or other characters in the page field as well.\n- Example seed: The volume field may also contain non-numeric characters.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Bibcode - Wikipedia", "url": "https://en.wikipedia.org/wiki/Bibcode_(identifier)", "title": "Bibcode - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: science, olympiad, astronomy, physics. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Category:Science competitions - Wikipedia (en.wikipedia.org). Evidence: Wikimedia Commons has media related to; This category has the following 16 subcategories, out of 16 total.; International Science Olympiad; Pages in category \"Science competitions\"", "reference_sheet": "TOPIC MAP: science | olympiad | astronomy | physics\nCORE FACTS/RULES:\n- Help From Wikipedia, the free encyclopedia The main article for this category is Science fair .\n- Wikimedia Commons has media related to Science competitions .\n- Subcategories This category has the following 16 subcategories, out of 16 total.\n- * Olympiads in India (3 C, 3 P) A Astronomy competitions (3 P) B Biology competitions (3 P) C Chemistry competitions (4 P) Computer science competitions (2 C, 38 P) G Geography com\n- 0–9 2016 Cyber Grand Challenge 2025 Indonesia National Science Olympiad A A*STAR Talent Search America COMPETES Act American Solar Challenge APEC Youth Science Festival B Brazilian\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Category:Science competitions - Wikipedia", "url": "https://en.wikipedia.org/wiki/Category:Science_competitions", "title": "Category:Science competitions - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: science, olympiad, physicists, physics, chemistry. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Category:Youth science - Wikipedia (en.wikipedia.org). Evidence: This category has the following 3 subcategories, out of 3 total.; International Young Physicists' Tournament; Young Scientist and Technology Exhibition; Pages in category \"Youth science\"", "reference_sheet": "TOPIC MAP: science | olympiad | physicists | physics | chemistry\nCORE FACTS/RULES:\n- Help From Wikipedia, the free encyclopedia Subcategories This category has the following 3 subcategories, out of 3 total.\n- I International Young Physicists' Tournament (4 P) L Linguistics olympiads (5 P) Y Young Scientist and Technology Exhibition (12 P) Pages in category \"Youth science\" The following \n- A Asian Physics Olympiad B The Big Bang Fair The Big Bang (TV series) C China Adolescents Science & Technology Innovation Contest Chinese Chemistry Olympiad D Deutsche Neurowissens\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Category:Youth science - Wikipedia", "url": "https://en.wikipedia.org/wiki/Category:Youth_science", "title": "Category:Youth science - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: science, united, states, festival, national, events, star, party. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Category:Science events in the United States - Wikipedia (en.wikipedia.org). Evidence: Pages in category \"Science events in the United States\"; The following 28 pages are in this category, out of 28 total.; This list may not reflect recent changes; National Medical Challenge Bowl", "reference_sheet": "TOPIC MAP: science | united | states | festival | national | events | star | party\nCORE FACTS/RULES:\n- Help From Wikipedia, the free encyclopedia Science portal United States portal Pages in category \"Science events in the United States\" The following 28 pages are in this category, \n- B Bay Area Science Festival M March for Science Mid Atlantic Star Party N National Fossil Day National Medical Challenge Bowl National Ocean Sciences Bowl National Science Bowl New\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Category:Science events in the United States - Wikipedia", "url": "https://en.wikipedia.org/wiki/Category:Science_events_in_the_United_States", "title": "Category:Science events in the United States - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: united, states, national, olympiad, category, competitions, academic, education. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Category:Education competitions in the United States - Wikipedia (en.wikipedia.org). Evidence: This category has only the following subcategory.; United States Academic Decathlon; Pages in category \"Education competitions in the United States\"; The following 20 pages are in this category, out of 20 total.", "reference_sheet": "TOPIC MAP: united | states | national | olympiad | category | competitions | academic | education\nCORE FACTS/RULES:\n- Help From Wikipedia, the free encyclopedia Subcategories This category has only the following subcategory.\n- U United States Academic Decathlon (4 P) Pages in category \"Education competitions in the United States\" The following 20 pages are in this category, out of 20 total.\n- A Ames Moot Court Competition C Campus Conservation Nationals Congress of French Culture in Florida G Georgia Educational Technology Fair K Knowledge Master Open N National Academi\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Category:Education competitions in the United States - Wikipedia", "url": "https://en.wikipedia.org/wiki/Category:Education_competitions_in_the_United_States", "title": "Category:Education competitions in the United States - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: category, recurring, events, established, festival, year, international, series. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Category:Recurring events established in 1974 - Wikipedia (en.wikipedia.org). Evidence: is for recurring events established in the year; Category:Recurring events disestablished in 1974; This category has the following 2 subcategories, out of 2 total.; Recurring sporting events established in 1974", "reference_sheet": "TOPIC MAP: category | recurring | events | established | festival | year | international | series\nCORE FACTS/RULES:\n- Help From Wikipedia, the free encyclopedia History portal 1970s portal This category is for recurring events established in the year 1974 .\n- 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1920s 1930s 1940s 1950s 1960s 1970s 1980s 1990s 2000s 2010s 2020s See also: Category:Recurring events disestablished in 1974 \n- F Festivals established in 1974 (2 C, 12 P) S Recurring sporting events established in 1974 (7 C, 130 P) Pages in category \"Recurring events established in 1974\" The following 42 p\n- A Alberta Culture Days Ashton Court Festival Atlantic Antic C Canadian International AutoShow ConFusion Culturama D Dainų dainelė Darwin Beer Can Regatta Darwin Rocksitters Club E \nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Category:Recurring events established in 1974 - Wikipedia", "url": "https://en.wikipedia.org/wiki/Category:Recurring_events_established_in_1974", "title": "Category:Recurring events established in 1974 - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: march, july, august, september, october, november, december, january. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Category:Articles that may contain original research from March 2023 - Wikipedia (en.wikipedia.org). Evidence: Articles that may contain original research; maintenance of the Wikipedia project; . It is not part of the encyclopedia and contains; , or groups articles by status rather than subject. Do not include this category in content categories (except for", "reference_sheet": "TOPIC MAP: march | july | august | september | october | november | december | january\nCORE FACTS/RULES:\n- Help From Wikipedia, the free encyclopedia Update this page Articles that may contain original research (refresh) Subtotals July 2007 2 August 2007 15 September 2007 148 October 20\n- It is not part of the encyclopedia and contains non-article pages , or groups articles by status rather than subject.\n- Do not include this category in content categories (except for eponymous maintenance categories).\n- It builds and maintains a list of pages primarily for the sake of the list itself.\n- They are not part of the encyclopedia's categorization scheme .\n- This category is hidden on its member pages —unless the corresponding user preference (Appearance → Show hidden categories) is set.\n- These categories can be used to track, build and organize lists of pages needing \"attention en masse \" (for example, pages using deprecated syntax), or that may need to be edited a\n- These categories also serve to aggregate members of several lists or sub-categories into a larger, more efficient list ( discriminated by classifications ).\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: This category combines all articles that may contain original research from March 2023 (2023-03) to enable us to work through the backlog more systematically.\n- Example seed: It is a member of Category:Articles that may contain original research .\n- Example seed: Random page in this category Filter this category by topic: Biography Women Food and drink Internet culture Linguistics Literature Books Entertainment Films Med\n- Example seed: 0–9 2020 United States presidential election in Wisconsin A Allan's Illustrated Edition of Tyneside Songs and Readings Amsterdam Apple IIc Plus Arabs in Bulgari\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Category:Articles that may contain original research from March 2023 - Wikipedia", "url": "https://en.wikipedia.org/wiki/Category:Articles_that_may_contain_original_research_from_March_2023", "title": "Category:Articles that may contain original research from March 2023 - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, science, forensics, counter-forensics. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Category:Forensic science - Wikipedia (en.wikipedia.org). Evidence: Wikimedia Commons has media related to; This category has the following 17 subcategories, out of 17 total.; Forensic science in popular culture; Pages in category \"Forensic science\"", "reference_sheet": "TOPIC MAP: forensic | science | forensics | counter-forensics\nCORE FACTS/RULES:\n- Help From Wikipedia, the free encyclopedia Law portal The main article for this category is Forensic science .\n- Wikimedia Commons has media related to Forensic science .\n- Subcategories This category has the following 17 subcategories, out of 17 total.\n- Forensic disciplines (17 C, 58 P) Forensic occupations (3 C, 7 P) * Forensic science in popular culture (5 C, 24 P) + Works about forensics (4 C, 6 P) C Causes of death (30 C, 151 \n- Forensic science C Centralite D Debbie Smith Act H Haemotaphonomy L Locard's exchange principle Lucilia mexicana M Minnesota Protocol N Necrobiome Necrophage O Outline of forensic \nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Category:Forensic science - Wikipedia", "url": "https://en.wikipedia.org/wiki/Category:Forensic_science", "title": "Category:Forensic science - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, file, usage, forensics, near-field, array, m-scale, surface. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: File:Teerahertz near-field array for μm-scale surface imaging (cropped).png - Wikipedia (en.wikipedia.org). Evidence: No higher resolution available.; Teerahertz_near-field_array_for_μm-scale_surface_imaging_(cropped).png; (768 × 257 pixels, file size: 343 KB, MIME type:; Commons is a freely licensed media file repository.", "reference_sheet": "TOPIC MAP: forensic | file | usage | forensics | near-field | array | m-scale | surface\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia File File history File usage Global file usage Metadata No higher resolution available.\n- Teerahertz_near-field_array_for_μm-scale_surface_imaging_(cropped).png (768 × 257 pixels, file size: 343 KB, MIME type: image/png ) This is a file from the Wikimedia Commons .\n- Information from its description page there is shown below.\n- Commons is a freely licensed media file repository.\n- Summary Description Teerahertz near-field array for μm-scale surface imaging (cropped).png English: Hillger, P., Jain, R., Grzyb, J., Mavarani, L., Bücher, T., Pfeiffer, U.\n- A solid-state 0.56 THz near-field array for μm-scale surface imaging.\n- In 2018 43rd International Conference on Infrared, Millimeter, and Terahertz Waves (IRMMW-THz) (pp.\n- Date 4 September 2018 Source Own work Author Terahertz-applications Other versions This image has been extracted from another file : Teerahertz near-field array for μm-scale surfac\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: A solid-state 0.56 THz near-field array for μm-scale surface imaging.\n- Example seed: In 2018 43rd International Conference on Infrared, Millimeter, and Terahertz Waves (IRMMW-THz) (pp.\n- Example seed: Licensing I, the copyright holder of this work, hereby publish it under the following license: This file is licensed under the Creative Commons Attribution-Shar\n- Example seed: You are free: to share – to copy, distribute and transmit the work to remix – to adapt the work Under the following conditions: attribution – You must give appr\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: File:Teerahertz near-field array for μm-scale surface imaging (cropped).png - Wikipedia", "url": "https://en.wikipedia.org/wiki/File:Teerahertz_near-field_array_for_%CE%BCm-scale_surface_imaging_(cropped).png", "title": "File:Teerahertz near-field array for μm-scale surface imaging (cropped).png - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: physiology, biology, physiological, science, anatomy, biochemistry. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Physiology - Wikipedia (en.wikipedia.org). Evidence: Science regarding functions in organisms or living systems; For the scientific journal, see; , the father of modern physiology, with his pupils; , the field can be divided into", "reference_sheet": "TOPIC MAP: physiology | biology | physiological | science | anatomy | biochemistry\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Science regarding functions in organisms or living systems For the scientific journal, see Physiology (journal) .\n- Oil painting depicting Claude Bernard , the father of modern physiology, with his pupils Part of a series on Biology Index Outline Glossary History ( timeline ) Key components Cell\n- [ 2 ] [ 3 ] As a subdiscipline of biology , physiology focuses on how organisms , organ systems , individual organs , cells , and biomolecules carry out chemical and physical funct\n- [ 4 ] According to the classes of organisms , the field can be divided into medical physiology , animal physiology , plant physiology , cell physiology , and comparative physiology\n- [ 4 ] Central to physiological functioning are biophysical and biochemical processes, homeostatic control mechanisms, and communication between cells.\n- [ 5 ] Physiological state is the condition of normal function.\n- In contrast, pathological state refers to abnormal conditions , including human diseases .\n- The Nobel Prize in Physiology or Medicine is awarded by the Royal Swedish Academy of Sciences for exceptional scientific achievements in physiology related to the field of medicine\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Foundations [ edit ] Because physiology focuses on the functions and mechanisms of living organisms at all levels, from the molecular and cellular level to the \n- Example seed: Anatomical knowledge is important in physiology because the structure and function of an organism are often dictated by one another.\n- Example seed: Biochemistry is the study of the chemical processes and substances that occur within living organisms.\n- Example seed: Knowledge of biochemistry provides the foundation for understanding cellular and molecular processes that are essential to the functioning of organisms.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Physiology - Wikipedia", "url": "https://en.wikipedia.org/wiki/Physiology", "title": "Physiology - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, anthropology, anthropologists, retrieved, august, remains, physical, archived. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Forensic anthropology - Wikipedia (en.wikipedia.org). Evidence: Application of the science of anthropology in a legal setting; Questioned document examination; Traffic collision reconstruction; is the application of the anatomical science of", "reference_sheet": "TOPIC MAP: forensic | anthropology | anthropologists | retrieved | august | remains | physical | archived\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Application of the science of anthropology in a legal setting Part of a series on Forensic science Physiological Anthropology Biology Bloodsta\n- A forensic anthropologist can assist in the identification of deceased individuals whose remains are decomposed, burned, mutilated or otherwise unrecognizable, as might happen in a\n- Forensic anthropologists are also instrumental in the investigation and documentation of genocide and mass graves .\n- Along with forensic pathologists , forensic dentists , and homicide investigators, forensic anthropologists commonly testify in court as expert witnesses .\n- Using physical markers present on a skeleton, a forensic anthropologist can potentially determine a person's age, sex , stature , and race .\n- In addition to identifying physical characteristics of the individual, forensic anthropologists can use skeletal abnormalities to potentially determine cause of death , past trauma\n- The methods used to identify a person from a skeleton relies on the past contributions of various anthropologists and the study of human skeletal differences .\n- Through the collection of thousands of specimens and the analysis of differences within a population, estimations can be made based on physical characteristics.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Through these, a set of remains can potentially be identified.\n- Example seed: The field of forensic anthropology grew during the twentieth century into a fully recognized forensic specialty involving trained anthropologists as well as num\n- Example seed: Modern uses [ edit ] [[Image: Srebrenica Massacre - Exhumed Grave of Victims - Potocari 2007.jpg|thumb|left|Exhumed bodies of victims of the 1995 Srebrenica Gen\n- Example seed: Today, forensic anthropology is a well-established discipline within the forensic field.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Forensic anthropology - Wikipedia", "url": "https://en.wikipedia.org/wiki/Forensic_anthropology", "title": "Forensic anthropology - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, science, biological, biology, microbiology, forensics. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Forensic biology - Wikipedia (en.wikipedia.org). Evidence: Forensic application of the study of biology; principles and techniques in the investigation of criminal and civil cases.; Forensic biology is primarily concerned with analyzing biological and; , which aids law enforcement in the identification of potential suspects or unidentified remains. This field encompasses various sub-branches, including", "reference_sheet": "TOPIC MAP: forensic | science | biological | biology | microbiology | forensics\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Forensic application of the study of biology Forensic biology is the application of biological principles and techniques in the investigation \n- [ 1 ] [ 2 ] Forensic biology is primarily concerned with analyzing biological and serological evidence in order to obtain a DNA profile , which aids law enforcement in the identifi\n- This field encompasses various sub-branches, including forensic anthropology , forensic entomology , forensic odontology , forensic pathology , and forensic toxicology .\n- Part of a series on Forensic science Physiological Anthropology Biology Bloodstain pattern analysis Dentistry DNA phenotyping DNA profiling Forensic genealogy Entomology Epidemiolo\n- By the end of the 7th century, forensic procedures were being used to determine the guilt of criminals.\n- [ 3 ] [ 4 ] An early pioneer in criminal identification through biology was Alphonse Bertillon , also known as the \"father of criminal identification\".\n- [ 5 ] In 1879, he introduced a scientific approach to personal identification by developing the science of anthropometry .\n- [ 6 ] [ 7 ] [ 8 ] Anthropometry involves the use of a series of body measurements to distinguish human individuals.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Karl Landsteiner , in 1901, introduced the categorization of human blood into groups: A, B, AB, and O.\n- Example seed: [ 9 ] From this discovery, blood typing , became a fundamental tool in forensic science.\n- Example seed: [ 10 ] [ 11 ] After this, advancements were made which contributed to the ease of using and detecting blood found at crime scenes, expanding the use of blood an\n- Example seed: Leone Lattes discovered a method to determine the blood group of dried bloodstains in 1915.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Forensic biology - Wikipedia", "url": "https://en.wikipedia.org/wiki/Forensic_biology", "title": "Forensic biology - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: blood, bloodstain, pattern, analysis, spatter, forensic, science, analysts. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Bloodstain pattern analysis - Wikipedia (en.wikipedia.org). Evidence: Examples of blood-spatter and droplet patterns; Questioned document examination; Traffic collision reconstruction; ) is a forensic discipline focused on analyzing", "reference_sheet": "TOPIC MAP: blood | bloodstain | pattern | analysis | spatter | forensic | science | analysts\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Forensic method Examples of blood-spatter and droplet patterns Part of a series on Forensic science Physiological Anthropology Biology Bloodst\n- This is done with the purpose of drawing inferences about the nature, timing and other details of the crime.\n- [ 1 ] At its core, BPA revolves around recognizing and categorizing bloodstain patterns, a task essential for reconstructing events in crimes or accidents, verifying statements mad\n- [ 2 ] Since the late 1950s, BPA experts have claimed to be able to use biology, physics, and mathematical calculations to reconstruct with accuracy events at a crime scene, and the\n- [ 3 ] Bloodstain pattern analysts use a variety of different classification methods.\n- The most common classification method was created by S.\n- Sutton, [ 4 ] and it divides bloodstains into three categories: passive, spatter, and altered.\n- Despite its importance, classifying bloodstain patterns poses challenges due to the absence of a universally accepted methodology and the natural uncertainty in interpreting such p\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Current classification methods often describe pattern types based on their formation mechanisms rather than observable characteristics, complicating the analysi\n- Example seed: [ 5 ] Ideally, BPA involves meticulous evaluation of pattern characteristics against objective criteria, followed by interpretation to aid crime scene reconstru\n- Example seed: [ 5 ] However, the lack of discipline standards in methodology underscores the need for consistency and rigor in BPA practices.\n- Example seed: The validity of bloodstain pattern analysis has been questioned since the 1990s, and more recent studies cast significant doubt on its accuracy.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Bloodstain pattern analysis - Wikipedia", "url": "https://en.wikipedia.org/wiki/Bloodstain_pattern_analysis", "title": "Bloodstain pattern analysis - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, bite, dental, mark, analysis, odontology, pmid, identification. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Forensic dentistry - Wikipedia (en.wikipedia.org). Evidence: Aspect of criminal investigation; this article is poorly organized and needs to be condensed and reordered.; Relevant discussion may be found on the; Learn how and when to remove this message", "reference_sheet": "TOPIC MAP: forensic | bite | dental | mark | analysis | odontology | pmid | identification\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Aspect of criminal investigation This article may require cleanup to meet Wikipedia's quality standards .\n- The specific problem is: this article is poorly organized and needs to be condensed and reordered.\n- Relevant discussion may be found on the talk page .\n- ( December 2022 ) ( Learn how and when to remove this message ) Dental X-Ray of formerly unidentified murder victim Pamela Buckley , found in 1976 Part of a series on Forensic scie\n- Forensic dentistry is used in both criminal and civil law.\n- [ 1 ] Forensic dentists assist investigative agencies in identifying human remains , particularly in cases when identifying information is otherwise scarce or nonexistent—for insta\n- [ 2 ] Forensic dentists may also be asked to assist in determining the age, race , occupation , previous dental history, and socioeconomic status of unidentified human beings.\n- Forensic dentists may make their determinations by using radiographs , ante- and post-mortem photographs , and DNA analysis.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Another type of evidence that may be analyzed is bite marks, whether left on the victim (by the attacker), the perpetrator (from the victim of an attack), or on\n- Example seed: However, this latter application of forensic dentistry has proven highly controversial, as no scientific studies or evidence substantiate that bite marks can de\n- Example seed: [ 3 ] Bite mark analysis has been condemned by several scientific bodies, such as the National Institute of Standards and Technology (NIST), [ 4 ] National Acad\n- Example seed: [ 6 ] Training [ edit ] India [ edit ] In India, certificate courses offered include a modular course by D.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Forensic dentistry - Wikipedia", "url": "https://en.wikipedia.org/wiki/Forensic_dentistry", "title": "Forensic dentistry - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, genetic, police, composite, genetics, murder, retrieved, snapshot. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: DNA phenotyping - Wikipedia (en.wikipedia.org). Evidence: Questioned document examination; Traffic collision reconstruction; is the process of predicting an organism's; using only genetic information collected from", "reference_sheet": "TOPIC MAP: forensic | genetic | police | composite | genetics | murder | retrieved | snapshot\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia DNA profiling technique Not to be confused with DNA profiling .\n- Part of a series on Forensic science Physiological Anthropology Biology Bloodstain pattern analysis Dentistry DNA phenotyping DNA profiling Forensic genealogy Entomology Epidemiolo\n- This term, also known as molecular photofitting, is primarily used to refer to the prediction of a person's physical appearance and/or biogeographic ancestry for forensic purposes.\n- DNA phenotyping uses many of the same scientific methods as those being used for genetically informed personalized medicine , in which drug responsiveness ( pharmacogenomics ) and \n- Significant genetic variants associated with a particular trait are discovered using a genome-wide association study (GWAS) approach, in which hundreds of thousands or millions of \n- Predictive modeling is then used to build a mathematical model for making trait predictions about new subjects.\n- Predicted phenotypes [ edit ] Human phenotypes are predicted from DNA using direct or indirect methods.\n- [ 1 ] With direct methods, genetic variants mechanistically linked with variable expression of the relevant phenotypes are measured and used with appropriate statistical methodolog\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: With indirect methods, variants associated with genetic component(s) of ancestry that correlate with the phenotype of interest, such as Ancestry Informative Mar\n- Example seed: The direct method is always preferable, for obvious reasons, but depending on the genetic architecture of the phenotype, is not always possible.\n- Example seed: [ 1 ] Biogeographic ancestry determination methods have been highly developed within the genetics community, as it is a key GWAS quality control step.\n- Example seed: [ 2 ] These approaches typically use genome-wide human genetic clustering and/or principal component analysis to compare new subjects to curated individuals wit\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: DNA phenotyping - Wikipedia", "url": "https://en.wikipedia.org/wiki/DNA_phenotyping", "title": "DNA phenotyping - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: original, archived, retrieved, forensic, evidence, april, analysis, samples. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: DNA profiling - Wikipedia (en.wikipedia.org). Evidence: Technique used to identify individuals via DNA characteristics; For DNA testing for inherited diseases, see; Questioned document examination; Traffic collision reconstruction", "reference_sheet": "TOPIC MAP: original | archived | retrieved | forensic | evidence | april | analysis | samples\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Technique used to identify individuals via DNA characteristics For DNA testing for inherited diseases, see Genetic testing .\n- The DNA double helix Part of a series on Forensic science Physiological Anthropology Biology Bloodstain pattern analysis Dentistry DNA phenotyping DNA profiling Forensic genealogy \n- DNA analysis intended to identify a species, rather than an individual, is called DNA barcoding .\n- DNA profiling is a forensic technique in criminal investigations , comparing criminal suspects' profiles to DNA evidence so as to assess the likelihood of their involvement in the \n- [ 1 ] [ 2 ] It is also used in paternity testing , [ 3 ] to establish immigration eligibility, [ 4 ] and in genealogical and medical research.\n- DNA profiling has also been used in the study of animal and plant populations in the fields of zoology, botany, and agriculture.\n- [ 5 ] DNA profiling was discovered by British geneticist Sir Alec Jeffreys in 1984 while he was working at the University of Leicester.\n- He developed the technique of genetic fingerprinting by realizing that some regions of DNA have highly variable repetitive sequences that are unique to each individual.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Background [ edit ] Sir Alec Jeffreys , pioneer of DNA profiling.\n- Example seed: His discovery led to the conviction of Colin Pitchfork in 1988.\n- Example seed: [ 1 ] Starting in the mid 1970s, scientific advances allowed the use of DNA as a material for the identification of an individual.\n- Example seed: The first patent covering the direct use of DNA variation for forensics ( US5593832A [ 6 ] ) was issued in 1997, continued from an application first filed by Je\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: DNA profiling - Wikipedia", "url": "https://en.wikipedia.org/wiki/DNA_profiling", "title": "DNA profiling - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: genealogy, genetic, archived, retrieved, original, forensic, data, cases. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Investigative genetic genealogy - Wikipedia (en.wikipedia.org). Evidence: Questioned document examination; Traffic collision reconstruction; Application of genealogy in a legal setting; Investigative genetic genealogy", "reference_sheet": "TOPIC MAP: genealogy | genetic | archived | retrieved | original | forensic | data | cases\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia CDC Lab testing Part of a series on Forensic science Physiological Anthropology Biology Bloodstain pattern analysis Dentistry DNA phenotyping \n- [ 1 ] As of December 2023, the use of this technology has solved a total of 651 criminal cases, including 318 individual perpetrators who were brought to light.\n- [ 2 ] [ 3 ] There have also been 464 decedents identified, as well as 4 living Does .\n- [ 4 ] The investigative power of genetic genealogy revolves around the use of publicly accessible genealogy databases such as GEDMatch and Family TreeDNA .\n- On GEDMatch, users are able to upload their genetic data from any direct-to-consumer company in an effort to identify relatives that have tested at companies other than their own.\n- Identifying unknown subjects through investigative genetic genealogy is done through the use of analysis of identity-by-descent (IBD) segments of DNA that indicate shared ancestors\n- [ 5 ] Data available in GEDMatch, which is composed of genetic profiles from approximately 1.2 million individuals, has proven capable of identifying a third cousin or closer in ov\n- [ 6 ] This information, used in tandem with demographic identifiers like age, gender, and place of residence, is sufficient for identifying any person who has a third cousin or clo\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Law enforcement agencies have leveraged the access to public databases by uploading crime-scene genealogy data and inferring relatives to potential suspects.\n- Example seed: [ 7 ] [ 8 ] [ 9 ] Family tree assembly and analysis of demographic identifiers is then carried out by genetic genealogy experts, either working directly for law\n- Example seed: Parabon Nanolabs is the most well known company working in this field.\n- Example seed: [ 10 ] By January 2021 Parabon claimed to have used genetic genealogy to produce an investigative lead in over 200 cases.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Investigative genetic genealogy - Wikipedia", "url": "https://en.wikipedia.org/wiki/Investigative_genetic_genealogy", "title": "Investigative genetic genealogy - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, entomology, insect, insects, body, species, flies, edit. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Forensic entomology - Wikipedia (en.wikipedia.org). Evidence: Application of insect and other arthropod biology to forensics; needs additional citations for; adding citations to reliable sources; . Unsourced material may be challenged and removed.", "reference_sheet": "TOPIC MAP: forensic | entomology | insect | insects | body | species | flies | edit\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Application of insect and other arthropod biology to forensics This article needs additional citations for verification .\n- Please help improve this article by adding citations to reliable sources .\n- Unsourced material may be challenged and removed.\n- Find sources: \"Forensic entomology\" – news · newspapers · books · scholar · JSTOR ( May 2025 ) ( Learn how and when to remove this message ) Pinned blowflies , studied in forensic \n- Insects may be found on cadavers or elsewhere around crime scenes in the interest of forensic science .\n- Forensic entomology is also used in cases of neglect and abuse of a property , as well as subjects of a toxicology analysis to detect drugs and incidents of food contamination .\n- Therefore, forensic entomology is divided into three subfields: medico-legal/medico-criminal entomology, urban , and stored-product .\n- The field revolves around studying the types of insects commonly found in and on the place of interest (such as cadavers), their life cycles , their presence in different environme\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 1 ] Insect assemblages can help approximate a body's primary location, as some insects are unique to specific areas.\n- Example seed: [ 2 ] In medico-criminal cases, the primary goal is often to determine the postmortem interval (PMI; time since death ) to aid in death investigations.\n- Example seed: Insect succession patterns are identified based on the time a species spends in each developmental stage and the number of generations produced since the insect\n- Example seed: [ 3 ] By analyzing insect development alongside environmental data such as temperature , humidity , and vapor density , forensic entomologists can estimate the \nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Forensic entomology - Wikipedia", "url": "https://en.wikipedia.org/wiki/Forensic_entomology", "title": "Forensic entomology - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, injury, analysis, exposure, test, outcome, probability, causation. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Forensic epidemiology - Wikipedia (en.wikipedia.org). Evidence: Questioned document examination; Traffic collision reconstruction; ) is a hybrid of principles and practices common to both; . FE is directed at filling the gap between clinical judgment and epidemiologic data for determinations of causality in civil", "reference_sheet": "TOPIC MAP: forensic | injury | analysis | exposure | test | outcome | probability | causation\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Part of a series on Forensic science Physiological Anthropology Biology Bloodstain pattern analysis Dentistry DNA phenotyping DNA profiling Fo\n- FE is directed at filling the gap between clinical judgment and epidemiologic data for determinations of causality in civil lawsuits and criminal prosecution and defense.\n- [ 1 ] [ 2 ] [ 3 ] [ 4 ] Forensic epidemiologists formulate evidence-based probabilistic conclusions about the type and quantity of causal association between an antecedent harmful \n- The conclusions resulting from an FE analysis can support legal decision-making regarding guilt or innocence in criminal actions, and provide an evidentiary support for findings of\n- Applications of forensic epidemiologic principles are found in a wide variety of types of civil litigation, including cases of medical negligence, toxic or mass tort, pharmaceutica\n- History [ edit ] The term Forensic Epidemiology was first associated with the investigation of bioterrorism in 1999, and coined by Dr.\n- Ken Alibek, the former chief deputy of the Soviet bioweapons program [ citation needed ] .\n- The scope of FE at that time was confined to the investigation of epidemics that were potentially man-made.\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: After the US Anthrax attacks of 2001 the CDC defined forensic epidemiology as a means of investigating possible acts of bioterrorism.\n- Example seed: At the present time FE is more widely known and described as the systematic application of epidemiology to disputed issues of causation that are decided in (pri\n- Example seed: The use of epidemiologic data and analysis as a basis for assessing general causation in US courts, particularly in toxic tort cases, has been described for mor\n- Example seed: [ 5 ] More recently FE has also been described as an evidence-based method of quantifying the probability of specific causation in individuals.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Forensic epidemiology - Wikipedia", "url": "https://en.wikipedia.org/wiki/Forensic_epidemiology", "title": "Forensic epidemiology - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, science, forensics, ecology. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Forensic limnology - Wikipedia (en.wikipedia.org). Evidence: Questioned document examination; Traffic collision reconstruction; , which focuses especially on the presence of; in crime scene samples and victims. Different methods are used to collect this data but all identify the ratios of different diatom species present in samples and compare those samples with the location of a crime scene.", "reference_sheet": "TOPIC MAP: forensic | science | forensics | ecology\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Part of a series on Forensic science Physiological Anthropology Biology Bloodstain pattern analysis Dentistry DNA phenotyping DNA profiling Fo\n- Different methods are used to collect this data but all identify the ratios of different diatom species present in samples and compare those samples with the location of a crime sc\n- [ 1 ] [ 2 ] [ 3 ] Diatom testing is a key method to distinguish between drowning or disposal of a body in water after death.\n- Use of diatoms [ edit ] Microscopic view of diatoms Diatoms are diverse microscopic single-celled algae with silica cell walls, called frustules , that are abundant in freshwater a\n- There are around 12,000 described species of diatoms that are identifiable based on the unique morphology of their frustules.\n- [ 4 ] For many species, there are also known habitat preferences, such as pH or salinity.\n- Which species are present and their relative abundances varies depending on their environment and time of year.\n- Additionally, when diatoms die, the frustules sink and are left behind as part of the water sediment providing a natural time series of diatom assemblages over seasonal and yearly \nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: Diatom monitoring programs track the species composition and relative abundances of in an environment, called a diatom profile, of different bodies of water.\n- Example seed: These profiles can then be used to compare with the species presence and abundances collected from crime scenes or victims.\n- Example seed: [ 5 ] [ 6 ] Benefits of diatoms [ edit ] The reason diatoms are a common tool to match water environments is because of the variability of their populations are\n- Example seed: [ 2 ] Diatoms can also be collected as evidence from items such as clothing or shoes to inform investigations.\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Forensic limnology - Wikipedia", "url": "https://en.wikipedia.org/wiki/Forensic_limnology", "title": "Forensic limnology - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, physician, physicians, science. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Medical jurisprudence - Wikipedia (en.wikipedia.org). Evidence: Branch of science and medicine; needs additional citations for; adding citations to reliable sources; . Unsourced material may be challenged and removed.", "reference_sheet": "TOPIC MAP: forensic | physician | physicians | science\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Branch of science and medicine Not to be confused with Health law or Medical law .\n- This article needs additional citations for verification .\n- Please help improve this article by adding citations to reliable sources .\n- Unsourced material may be challenged and removed.\n- Find sources: \"Medical jurisprudence\" – news · newspapers · books · scholar · JSTOR ( July 2013 ) ( Learn how and when to remove this message ) Autopsy room of the Charité Berlin R\n- [ 1 ] As modern medicine is a legal creation, regulated by the state, and medicolegal cases involving death, rape, paternity , etc.\n- require a medical practitioner to produce evidence and appear as an expert witness , these two fields have traditionally been interdependent.\n- [ 2 ] Forensic medicine, which includes forensic pathology , is a narrower frontline field which involves the collection, documentation, analysis and presentation of objective info\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 3 ] When investigating a death, forensic pathologists: perform autopsies when required may be appointed as coroners to investigate cases of suspicious death d\n- Example seed: [ 4 ] The Australian Museum shows in a step by step virtual demonstration what happens during an autopsy procedure.\n- Example seed: [ 5 ] History [ edit ] Song Ci (1186–1249) was probably the first forensic scientist.\n- Example seed: He recorded all the known forensic techniques at the time in his book known as the Collected Cases of Injustice Rectified .\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Medical jurisprudence - Wikipedia", "url": "https://en.wikipedia.org/wiki/Medical_jurisprudence", "title": "Medical jurisprudence - Wikipedia"}
{"event": "mixed_science_olympiad", "division": "B/C", "source": "weak_supervision_web_scrape", "analysis": "Covered topics: forensic, pollen, palynology, analysis, samples, science, suspect, issn. Skills practiced: content extraction, concept linking, rule recall, fast lookup. Frequency map: high focus on core concepts shown in page sections. Missing or weak areas: event-specific equations, worked practice cases, test-day heuristics. Source page: Forensic palynology - Wikipedia (en.wikipedia.org). Evidence: Forensic application of the study of particulate matter; 1871 plate of magnified pollen grains; Questioned document examination; Traffic collision reconstruction", "reference_sheet": "TOPIC MAP: forensic | pollen | palynology | analysis | samples | science | suspect | issn\nCORE FACTS/RULES:\n- From Wikipedia, the free encyclopedia Forensic application of the study of particulate matter 1871 plate of magnified pollen grains Part of a series on Forensic science Physiologic\n- [ 1 ] Pollen can reveal where a person or object has been, because regions of the world, countries, and even different parts of a single garden will have a distinctive pollen assem\n- [ 2 ] Pollen evidence can also reveal the season in which a particular object picked up the pollen.\n- [ 3 ] Recent research into forensic palynology has seen advancements in DNA barcoding from pollen, to the level of singular pollen molecules, allowing DNA profiles to be created fr\n- [ 4 ] Palynology is the study of palynomorphs – microscopic structures of both animal and plant origin that are resistant to decay.\n- This includes spermatophyte pollen, as well as spores (fungi, bryophytes , and ferns), dinoflagellates , and various other organic microorganisms – both living and fossilized.\n- [ 5 ] There are a variety of ways in which the study of these microscopic, walled particles can be applied to criminal forensics.\n- In areas such as New Zealand, where the demand for this field is high, forensic palynology has been used as evidence in many different case types that range anywhere from non-viole\nCOMMON TRAPS:\n- Confusing definitions across adjacent topics.\n- Memorizing lists without condition/context checks.\n- Skipping unit/state assumptions in applied questions.\nFAST SOLVING PATTERNS:\n- Identify topic first, then map to a single governing rule.\n- Write knowns/unknowns in compact notation before solving.\n- Eliminate options that violate core constraints.\nMINI WORKED EXAMPLES:\n- Example seed: [ 6 ] Pollen has been used to trace activity at mass graves in Bosnia , [ 7 ] pinpoint the scene of a crime, [ 6 ] and catch a burglar who brushed against a Hyp\n- Example seed: [ 8 ] Because pollen has distinct morphology and is relatively indestructible, it is likely to adhere to a variety of surfaces often without notice and has even\n- Example seed: [ 9 ] Present status [ edit ] Forensic palynology is an evolving forensic science application mostly utilized in countries such as New Zealand , Australia , and\n- Example seed: [ 1 ] It is relatively \"small, disparate, and fragmented\" compared to the other approaches, thus, there is no thorough guide to achieve the best practice in for\nLAST-MINUTE CHECKLIST:\n- Key terms and symbols reviewed\n- Typical edge cases reviewed\n- High-yield rule exceptions reviewed\n- Source title cross-check: Forensic palynology - Wikipedia", "url": "https://en.wikipedia.org/wiki/Forensic_palynology", "title": "Forensic palynology - Wikipedia"}
